[
    {
        "id": "2018-10-05-office-trivia-night",
        "name": "BEARS.BEETS.the office trivia",
        "description": "Fact. Cafe Nostalgica is the best place you can spend your Monday night. Scranton will be taking over Ottawa so take a break from being The World's Best Boss, your classes at art school, or beet farming to prove you know the most about the Dunder Mifflin family. I can guarantee that you'll leave satisfied and smiling...that's what she said!\n\nGet ready for a night full of trivia from all the seasons and an ample amount of that's what she said jokes (yeah, it might be a good idea to leave your HR friends at home). Reserve your spot by signing up as a team (of 1-4, $20 per team). The top team will get to take home a Dundie (other prizes will also be available)!\n\nThink you've got what it takes to run Dunder Mifflin Scranton? Or will you settle for Assistant to the Regional Manager? Come join us October 5th, 2017 at Cafe Nostalgica to find out!\n\nFor questions or concerns, please email any of the following:\nHeemel Saha - chair@ieeeuottawa.ca\n\n\n**",
        "FR": "Cafe Nostalgica est le meilleur endroit où vous pouvez passer votre lundi soir. Ottawa se transformera en Scranton pour une soirée, alors prenez une pause d'être le meilleur patron du monde, des cours à l'école d'art ou de l'élevage de betteraves pour prouver que vous en connaissez le plus à propos de la famille Dunder Mifflin. Je peux vous garantir que vous quitterez satisfait et souriant ... \"that's what she said!\"\n\nPréparez-vous pour une soirée avec des questions venant de toutes les saisons et plusieurs blagues \"that's what she said\" (ça pourrait être une bonne idée de laisser vos amis HR à la maison). Réservez votre place en vous inscrivant en équipe (de 1-4, 20 $ par coéquipier, lien d'inscription d'équipe à venir). La meilleure équipe recevra un Dundee (d'autres prix seront également disponibles)!\n\nPensez-vous avoir ce qu'il faut pour gérez Dunder Mifflin Scranton? Ou bien serrez vous satisfait avec le poste d'assistant du directeur régional? Venez nous rejoindre le 2 octobre 2017 chez Cafe Nostalgica pour en savoir plus!\n\nPour des questions ou des préoccupations, veuillez envoyer un courriel à l'une des adresses suivantes:\nHeemel Saha - chair@ieeeuottawa.ca",
        "url": "https://www.facebook.com/events/1896432193991285",
        "image": "../images/events/2018-2019/office_trivia_night_2018_10_05.jpg"
    },
    {
        "id": "2018-09-17-engibeering-wings",
        "name": "EngiBEERing: Wing Night Edition",
        "description": "35 CENT WINGS, $3 BURGERS, $2 FRENCH FRIES, $5 POUTINE UNTIL MIDNIGHT!\n\nWhat's better than drinking away all of your back to school sorrows? Nothing. Come get a beer (or 20) with us and have a good time! The best thing about Patty's is that they have a clubbing section upstairs (pub/bar section is on the main floor). Whether you're excited or stressed for school, you deserve a drink to celebrate the start of a new semester. All students regardless of faculty are welcome.\n\nThis is a 19+ event.\n\nPlease direct all questions to Heemel Saha: chair@ieeeuottawa.ca",
        "FR": "AILES POUR 35¢, 3 $ BURGERS, 2 $ FRITES FRANÇAIS, 5 $ POUTINE JUSQU'À MINUIT! \n \n Quoi de mieux que de boire tous vos chagrins de retour à l'école? Rien. Venez prendre une bière (ou 20) avec nous et passez un bon moment ! La meilleure chose à propos de Patty's est qu'ils ont une section clubbing à l'étage (la section pub / bar est au rez-de-chaussée). Que vous soyez excité ou stressé pour l'école, vous méritez un verre pour célébrer le début d'un nouveau semestre. les étudiants, quelle que soit leur faculté, sont les bienvenus. \n \nC'est un événement de 19 ans et plus. \n \nVeuillez adresser toutes les questions à Heemel Saha: chair@ieeeuottawa.ca ",
        "url": "https://www.facebook.com/events/1185229758324733",
        "image": "../images/events/2018-2019/engibeering_wings_2018_09_17.jpg"
    },
    {
        "id": "2018-09-24-google-uo",
        "name": "Google at University of Ottawa",
        "description": "Google is coming to the University of Ottawa on September 24 and 25 to host multiple events over the span of the two days! There will be office hours, a resume/interview workshop, and a coding workshop. All of these events are for you to learn more about life at Google and specific job/internship opportunities Google has for students. There will be food and swag while they last! See the poster for more details and be sure to register as some events have limited capacity:\nhttp://bit.ly/2AOIVoD\n\nGoogle sera présent à l'Université d'Ottawa le 24 et 25 septembre pour organiser plusieurs événements intéressants destinés aux étudiants! Au cours de ces deux jours, il y aura un atelier sur les CVs, un atelier de programmation, et des heures de bureau pendant lesquels vous pouvez bavarder avec des employés de Google. Tous ces événements sont organisés pour vous aider à vous renseigner sur les opportunités professionnelles offertes aux étudiant(e)s par Google, ainsi que la culture professionnelle de Google. Il y aura des rafraîchissements et des cadeaux (tant que disponibles)! Pour vous renseigner davantage, veuiller consulter l'affiche ci-jointe. Assurez-vous de vous y inscrire d'avance, car certains événements ont une capacité limitée: http://bit.ly/2AOIVoD",
        "FR": "Google sera présent à l'Université d'Ottawa le 24 et 25 septembre pour organiser plusieurs événements intéressants destinés aux étudiants! Au cours de ces deux jours, il y aura un atelier sur les CVs, un atelier de programmation, et des heures de bureau pendant lesquels vous pouvez bavarder avec des employés de Google. Tous ces événements sont organisés pour vous aider à vous renseigner sur les opportunités professionnelles offertes aux étudiant(e)s par Google, ainsi que la culture professionnelle de Google. Il y aura des rafraîchissements et des cadeaux (tant que disponibles)! Pour vous renseigner davantage, veuiller consulter l'affiche ci-jointe. Assurez-vous de vous y inscrire d'avance, car certains événements ont une capacité limitée: http://bit.ly/2AOIVoD",
        "url": "https://www.facebook.com/events/2049645762013536",
        "image": "../images/events/2018-2019/google_uo_2018_09_24.jpg"
    },
    {
        "id": "2018-10-02-ieee-day",
        "name": "IEEE Day 2018!",
        "description": "FREE PIZZA!*\nDid we get your attention? Great! IEEE Day is fast approaching and we will be commemorating this anniversary of the first time IEEE members gathered to share their technical ideas in 1884 the way they would've wanted, FREE PIZZA!*\n\nCome hang out with us in the IEEE office on Tuesday October 2nd in STE 4026 to learn more about IEEE and the benefits getting a membership can have!\n\n*while quantities last",
        "FR": "PIZZA GRATUITE! *\nAvons-nous attiré votre attention? Génial! La Journée IEEE approche à grands pas et nous commémorerons cet anniversaire de la première fois que les membres de l'IEEE se sont réunis pour partager leurs idées techniques en 1884 comme ils l'auraient souhaité, PIZZA GRATUITE ! * \n \nVenez traîner avec nous dans le bureau de l'IEEE le mardi 2 octobre à STE 4026 pour en savoir plus sur l'IEEE et les avantages de l'adhésion peuvent avoir! \n \n * jusqu'à épuisement des stocks ",
        "url": "https://www.facebook.com/events/2368048349877268",
        "image": "../images/events/2018-2019/ieee_day_2018_10_02.jpg"
    },
    {
        "id": "2018-09-28-agm-continued",
        "name": "IEEE AGM 2018 (continued)",
        "description": "The IEEE uOttawa Student Branch will be continuing our Annual General Meeting to discuss by-elections and constitution changes.\n\nBY-ELECTIONS:\nBy-elections will be taking place during this AGM for the vacant executive positions of the general election for the 2018-2019 term. These positions will include:\n\nVP Communications\n\nThe following executive positions within the IEEE uOttawa Photonics Student Chapter are also vacant, but please note that their eligibility is limited to GRADUATE STUDENTS ONLY, and strong preference is given to candidates with a specialization in Photonics:\n\nChair, Photonics Student Chapter\nVice-Chair, Photonics Student Chapter\n\nIf you are interested in applying for a position on the 2018-2019 Executive Committee, please email chair@ieeeuottawa.ca with your FULL NAME, STUDENT NUMBER, PROGRAM AND YEAR OF STUDY, and state the position you will be running for. The by-elections will be conducted within the AGM by the executive committee.\n\nAs for your application, you along with the other nominees will be allocated 1-2 minutes during the meeting to give a short speech about yourself and what makes you the best candidate for the position. To prepare for this, I would recommend familiarizing yourself with this role's mandate in the IEEE uOttawa Constitution\n(http://www.ieeeuottawa.ca/files/constitution1.pdf). Afterwards, the executives may ask you a few questions regarding the role, and then have an internal vote with the execs. Results will be released during the meeting.\n\n__________________________\n\nLa Branche Étudiante de l'IEEE à uOttawa continuera son Assemblée générale annuelle afin de mener des élections partielles et d'aborder des changements proposées à sa Constitution.\n\nÉLECTIONS PARTIELLES:\nDes élections partielles auront lieu pendant cette réunion afin de remplir des postes exécutifs vides pour l'année scolaire 2018-2019. Les postes vides consistent des suivants:\n\nV.-P. Communications\n\nDe plus, les deux postes de la Branche Étudiante de la Photonique de IEEE uOttawa sont également vides. Cependant, veuillez noter que SEULEMENT LES ÉTUDIANT(E)S DIPLÔMÉ(E)S peuvent postuler pour ces postes, et qu'une forte préférence sera donnée aux étudiant(e)s diplômé(e)s avec une spécialisation en photonique:\n\nPrésident(e), Branche Étudiante de la Photonique\nVice-Président(e), Branche Étudiante de la Photonique\n\nSi vous souhaitez postuler pour un poste sur le comité exécutif 2018-2019, veuillez envoyer un courriel à chair@ieeeuottawa.ca avec votre NOM AU COMPLET, NUMÉRO ÉTUDIANT, PROGRAMME D'ÉTUDES et ANNÉE D'ÉTUDES, et indiquer le rôle pour lequel vous postulez. Les élections partielles seront menés par le comité lors de la réunion.\n\nEn ce qui concerne votre candidature, vous ainsi que les autre candidat(e)s seront allouées 1 à 2 minutes durant la réunion pour faire un bref discours pendant lequel vous pouvez parler de vous-même et pourquoi vois êtes le/la meilleur(e) candidat(e) pour le poste. Pour vous préparer, il est recommandé que vous vous familiarisez avec le mandat du poste en consultant la Constitution de la Branche (http://www.ieeeuottawa.ca/files/constitution1.pdf). Par après, le comité vous demandera quelques questions par rapport au rôle, et mènera un vote interne. Les résultats du vote seront dévoilés pendant la réunion.",
        "FR": "La Branche Étudiante de l'IEEE à uOttawa continuera son Assemblée générale annuelle afin de mener des élections partielles et d'aborder des changements proposées à sa Constitution.\n\nÉLECTIONS PARTIELLES:\nDes élections partielles auront lieu pendant cette réunion afin de remplir des postes exécutifs vides pour l'année scolaire 2018-2019. Les postes vides consistent des suivants:\n\nV.-P. Communications\n\nDe plus, les deux postes de la Branche Étudiante de la Photonique de IEEE uOttawa sont également vides. Cependant, veuillez noter que SEULEMENT LES ÉTUDIANT(E)S DIPLÔMÉ(E)S peuvent postuler pour ces postes, et qu'une forte préférence sera donnée aux étudiant(e)s diplômé(e)s avec une spécialisation en photonique:\n\nPrésident(e), Branche Étudiante de la Photonique\nVice-Président(e), Branche Étudiante de la Photonique\n\nSi vous souhaitez postuler pour un poste sur le comité exécutif 2018-2019, veuillez envoyer un courriel à chair@ieeeuottawa.ca avec votre NOM AU COMPLET, NUMÉRO ÉTUDIANT, PROGRAMME D'ÉTUDES et ANNÉE D'ÉTUDES, et indiquer le rôle pour lequel vous postulez. Les élections partielles seront menés par le comité lors de la réunion.\n\nEn ce qui concerne votre candidature, vous ainsi que les autre candidat(e)s seront allouées 1 à 2 minutes durant la réunion pour faire un bref discours pendant lequel vous pouvez parler de vous-même et pourquoi vois êtes le/la meilleur(e) candidat(e) pour le poste. Pour vous préparer, il est recommandé que vous vous familiarisez avec le mandat du poste en consultant la Constitution de la Branche (http://www.ieeeuottawa.ca/files/constitution1.pdf). Par après, le comité vous demandera quelques questions par rapport au rôle, et mènera un vote interne. Les résultats du vote seront dévoilés pendant la réunion.",
        "url": "https://www.facebook.com/events/325062718266905",
        "image": "../images/events/2018-2019/agm_continued_2018_09_28.jpg"
    },
    {
        "id": "2018-10-31-learn-python",
        "name": "SESA x IEEE Python Review Session",
        "description": "PYTHON REVIEW SESSION!!\nWe will help you get the A+ you deserve😉\nWhen: Mon Oct 29 and Wed Oct 31, 5:00-9:00\nWhere: SITE 5084\nThere will be cookies!! 💞🍪",
        "FR": "SESSION DE REVUE PYTHON !! \nNous vous aiderons à obtenir le A + que vous méritez😉 \nQuand: lun 29 oct. Et mer 31 oct. 5:00-9:00 \nOù: SITE 5084 \nIl y aura des biscuits !! 💞🍪",
        "url": "https://www.facebook.com/events/363090764429767",
        "image": "../images/events/2018-2019/learn_python_workshop_2018_10_31.jpg"
    },
    {
        "id": "2018-11-15-wie-women-tech-panel",
        "name": "IEEE WIE: Women in Tech Panel",
        "description": "IEEE's WIE is excited to host its first annual Women in Tech panel and is welcomed to ALL students! This is an opportunity to hear some of the most inspiring and accomplished women speak about their experiences and their journey to success along with some great career advice to students! On top of that, you'll get to build meaningful connections with the panelists and other industry professionals who are all very excited to meet the students!\n\nTHE EVENT IS FREE AND FREE FOOD WILL BE PROVIDED (After all, we are all students who love free food)\n-------------------------------------------------------------------------------------------\nIEEE est ravi à présenter notre premier annuel panel de Femmes en Technologie. Tous les étudiants sont bienvenus à l'évènement. C'est une occasion d'écouter les histoires des intervenants accomplis à propos de leurs expériences, succès et conseils. De plus, c'est un évènement parfait pour développer des connections avec les panélistes et autres professionnels dans l'industrie. Nous avons hâte de vous avoir et de vous rencontrer.\n\nL’ÉVÈNEMENT EST COMPLÈTEMENT GRATUIT ET LA NOURRITURE EST FOURNIE (Qui n'aime pas la nourriture gratuite ?!)",
        "FR": "IEEE est ravi à présenter notre premier annuel panel de Femmes en Technologie. Tous les étudiants sont bienvenus à l'évènement. C'est une occasion d'écouter les histoires des intervenants accomplis à propos de leurs expériences, succès et conseils. De plus, c'est un évènement parfait pour développer des connections avec les panélistes et autres professionnels dans l'industrie. Nous avons hâte de vous avoir et de vous rencontrer.\n\nL’ÉVÈNEMENT EST COMPLÈTEMENT GRATUIT ET LA NOURRITURE EST FOURNIE (Qui n'aime pas la nourriture gratuite ?!)",
        "url": "https://www.facebook.com/events/341275953300827",
        "image": "../images/events/2018-2019/wie_women_tech_panel_2018_11_15.jpg"
    },
    {
        "id": "2018-11-09-cracking-code-session-1",
        "name": "Cracking the Coding Interview - Session #1",
        "description": "If your dream company invited you to their offices for a technical interview RIGHT NOW, would you feel well-prepared?\n\nWe invite you to attend \"Cracking the Coding Interview\" — a series of technical interview workshops organized jointly by IEEE uOttawa, CSSA, and SESA, featuring questions from \"Cracking the Coding Interview\" by Gayle McDowell! 💡📖\n\nThe workshops will last 1 hour each, during which experienced mentors will explain and solve certain questions from the book, as well as discuss other interview tips! 📋 The first session will serve as an introduction, and increasingly difficult problems will be discussed in future sessions.\n\nDon't put it off any longer - join us Friday, November 9th at 7PM in CBY B012 for our intro session, and get ready to learn!\n\nSession 1 : Friday, November 9th, 7PM\n\nSession 2: Friday, November 16th, 7PM\n\nSession 3: Friday, November 23rd, 7PM\n\n_______________________________\n\nSi vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?\n\nNous vous invitons à participer à Cracking the Coding Interview – une série d’ateliers (organisée conjointement par IEEE uOttawa, CSSA, et SESA) abordant tout ce qui concerne les entrevues techniques, avec des questions tirées du livre « Cracking the Coding Interview » par Gayle McDowell ! 💡📖\n\nLes ateliers seront d’une durée d’une heure chaque; pendant ce temps, des mentors expérimentés résoudront et vous expliqueront des questions techniques tirées du livre. Les mentors discuteront également de conseils pour des entrevues ! 📋 La première séance servira d'introduction, et des questions de plus en plus difficiles seront abordées lors des futures séances.\n\nN’attendez pas – rejoignez-nous lors de notre séance d’introduction le vendredi 9 novembre à 19h au local CBY B012, et soyez prêts à apprendre !\n\nPremière séance : le vendredi 9 novembre, 19h\n\nDeuxième séance : le vendredi 16 novembre, 19h\n\nTroisième séance : le vendredi 23 novembre, 19h",
        "FR": "Si vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?\n\nNous vous invitons à participer à Cracking the Coding Interview – une série d’ateliers (organisée conjointement par IEEE uOttawa, CSSA, et SESA) abordant tout ce qui concerne les entrevues techniques, avec des questions tirées du livre « Cracking the Coding Interview » par Gayle McDowell ! 💡📖\n\nLes ateliers seront d’une durée d’une heure chaque; pendant ce temps, des mentors expérimentés résoudront et vous expliqueront des questions techniques tirées du livre. Les mentors discuteront également de conseils pour des entrevues ! 📋 La première séance servira d'introduction, et des questions de plus en plus difficiles seront abordées lors des futures séances.\n\nN’attendez pas – rejoignez-nous lors de notre séance d’introduction le vendredi 9 novembre à 19h au local CBY B012, et soyez prêts à apprendre !\n\nPremière séance : le vendredi 9 novembre, 19h\n\nDeuxième séance : le vendredi 16 novembre, 19h\n\nTroisième séance : le vendredi 23 novembre, 19h",
        "url": "https://www.facebook.com/events/1921377821243067",
        "image": "../images/events/2018-2019/cracking_code_session_1_2018_11_09.jpg"
    },
    {
        "id": "2018-11-20-coding-challenge",
        "name": "3rd IEEE Coding Challenge",
        "description": "The IEEE Coding Challenge is back for another semester!\n\nCome out to SITE 2060 on Tuesday, Nov. 20th for a one-hour coding challenge.\n\nYou must sign up for the challenge using this link:\nhttps://docs.google.com/forms/d/e/1FAIpQLSckHUd8NJorRMhbgu-isZ3rwxyeYqy6OO5Q4mzvBFtvM0c3Gg/viewform?usp=sf_link\n\nThere will be prizes and fooooood!!\n\nRules:\n- Participants must work individually.\n- Participants will have exactly 1 hour to complete the challenge.\n- The coding challenge will begin at 7:15pm sharp.\n- You may use any programming language.\n\nSolutions will be judged based on algorithm efficiency and the time it takes to complete the challenge.\n\nParticipants will have the chance to discuss the solutions after the challenge and are encouraged to stick around to explain their approach.\n\n---------------------------------------------------------------------------------------\nDéfi de programmation de l’IEEE : édition automne 2018!\n\nPrésentez-vous au local STE 2060 le mardi 20 novembre pour un défi de programmation d'une durée d'une heure.\n\nVeuillez vous inscrire au défi à l’aide du lien suivant :\nhttps://docs.google.com/forms/d/e/1FAIpQLSckHUd8NJorRMhbgu-isZ3rwxyeYqy6OO5Q4mzvBFtvM0c3Gg/viewform?usp=sf_link\n\nIl y aura de la nourriture et des prix!!!\n\nRèglements et contraintes :\n-Les participants doivent travailler de façon individuelle\n-‎Le défi aura une durée d’exactement une heure\n-‎Le défi commencera à exactement 19h15\n-‎En ce qui concerne le langage de programmation utilisé, les participants auront le choix libre\n\nLes critères d’évaluation pour les solutions prendront en compte principalement l'efficacité de l'algorithme et le temps requis pour résoudre le défi.\n\nAprès le défi, les participants auront l'opportunité de discuter de leurs solutions, et sont encouragé(e)s d’expliquer leur méthode utilisée pour résoudre le défi.",
        "FR": "Défi de programmation de l’IEEE : édition automne 2018!\n\nPrésentez-vous au local STE 2060 le mardi 20 novembre pour un défi de programmation d'une durée d'une heure.\n\nVeuillez vous inscrire au défi à l’aide du lien suivant :\nhttps://docs.google.com/forms/d/e/1FAIpQLSckHUd8NJorRMhbgu-isZ3rwxyeYqy6OO5Q4mzvBFtvM0c3Gg/viewform?usp=sf_link\n\nIl y aura de la nourriture et des prix!!!\n\nRèglements et contraintes :\n-Les participants doivent travailler de façon individuelle\n-‎Le défi aura une durée d’exactement une heure\n-‎Le défi commencera à exactement 19h15\n-‎En ce qui concerne le langage de programmation utilisé, les participants auront le choix libre\n\nLes critères d’évaluation pour les solutions prendront en compte principalement l'efficacité de l'algorithme et le temps requis pour résoudre le défi.\n\nAprès le défi, les participants auront l'opportunité de discuter de leurs solutions, et sont encouragé(e)s d’expliquer leur méthode utilisée pour résoudre le défi.",
        "url": "https://www.facebook.com/events/1124103607752638",
        "image": "../images/events/2018-2019/coding_challenge_2018_11_20.jpg"
    },
    {
        "id": "2018-11-07-big-eng-little-eng",
        "name": "Big Eng Little Eng Kickoff!",
        "description": "Start your eng(ines) and accelerate your academic career by meeting innovative engineering students and professionals!\n\nThis is the first official event for IEEE uOttawa WIE's Big Eng Little Eng (BELE) Mentorship Program - EVERYONE is welcome to attend this casual networking event (mentorship applications not required to attend).\n\nIf you are interested in signing up for BELE Mentorship (all students welcome):\nhttps://goo.gl/forms/PKNEvICdl9TUwzW92\n\nDon't know what BELE is? Fear not! You've come to the right place. BELE is a mentorship program for first year studunts to get adjusted to life at university. All first years get paired up with an upper year (ideally in the same discipline) so they've got someone to help guide them through the craziness that is first year engineering.\n\nCome hang out and play some board games and enjoy some hot chocolate after the craziness of midterm season!\n-----------\nCommencez votre eng (Ines) et accélérez votre carrière académique en rencontrant des étudiants et des professionnels innovants en ingénierie !\n\nC'est le premier événement officiel pour le programme de mentorat de l'ieee uottawa wie (bele). Tout le monde est le bienvenu pour assister à cet événement de réseautage occasionnel (les demandes de mentorat ne sont pas tenues d'y assister).\n\nSi vous êtes intéressé (e) à vous inscrire pour bele mentorat (tous les étudiants bienvenus) :\nhttps://goo.gl/forms/PKNEvICdl9TUwzW92\n\nTu ne sais pas ce que c'est ? Ne craignez rien ! Vous êtes au bon endroit. Bele est un programme de mentorat pour la première année studunts pour s'adapter à la vie à L'Université. Toutes les premières années s'allient avec une année supérieure (idéalement dans la même discipline) donc ils ont quelqu'un pour aider à les guider à travers la folie qui est l'ingénierie de première année.\n\nVenez traîner et jouer à des jeux de société et profiter du chocolat chaud après la folie de la saison à mi-parcours !",
        "FR": "Commencez votre eng (Ines) et accélérez votre carrière académique en rencontrant des étudiants et des professionnels innovants en ingénierie !",
        "url": "https://www.facebook.com/events/711217565918194",
        "image": "../images/events/2018-2019/big_eng_little_eng_2018_11_07.jpg"
    },
    {
        "id": "2018-11-16-cracking-code-session-2",
        "name": "Cracking the Coding Interview - Session #2",
        "description": "We hope you enjoyed the intro session of Cracking the Coding Interview last week! Join us this friday for session #2, where we will go over some data structures and coding questions that involve them!\n\nIf you haven't already joined the Facebook discussion group for Cracking the Coding Interview, you can find it here: https://www.facebook.com/groups/569650000139322/?ref=br_rs\n\n______________________________\n\nIf your dream company invited you to their offices for a technical interview RIGHT NOW, would you feel well-prepared?\n\nWe invite you to attend \"Cracking the Coding Interview\" — a series of technical interview workshops organized jointly by IEEE uOttawa, CSSA, and SESA, featuring questions from \"Cracking the Coding Interview\" by Gayle McDowell! 💡📖\n\nThe workshops will last 1 hour each, during which experienced mentors will explain and solve certain questions from the book, as well as discuss other interview tips! 📋 The first session will serve as an introduction, and increasingly difficult problems will be discussed in future sessions.\n\nDon't put it off any longer - join us Friday, November 9th at 7PM in CBY B012 for our intro session, and get ready to learn!\n\nSession 1 : Friday, November 9th, 7PM\n\nSession 2: Friday, November 16th, 7PM\n\nSession 3: Friday, November 23rd, 7PM\n\n_______________________________\n\nSi vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?\n\nNous vous invitons à participer à Cracking the Coding Interview – une série d’ateliers (organisée conjointement par IEEE uOttawa, CSSA, et SESA) abordant tout ce qui concerne les entrevues techniques, avec des questions tirées du livre « Cracking the Coding Interview » par Gayle McDowell ! 💡📖\n\nLes ateliers seront d’une durée d’une heure chaque; pendant ce temps, des mentors expérimentés résoudront et vous expliqueront des questions techniques tirées du livre. Les mentors discuteront également de conseils pour des entrevues ! 📋 La première séance servira d'introduction, et des questions de plus en plus difficiles seront abordées lors des futures séances.\n\nN’attendez pas – rejoignez-nous lors de notre séance d’introduction le vendredi 9 novembre à 19h au local CBY B012, et soyez prêts à apprendre !\n\nPremière séance : le vendredi 9 novembre, 19h\n\nDeuxième séance : le vendredi 16 novembre, 19h\n\nTroisième séance : le vendredi 23 novembre, 19h",
        "FR": "Si vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?",
        "url": "https://www.facebook.com/events/351616255602374",
        "image": "../images/events/2018-2019/cracking_code_session_2_2018_11_16.jpg"
    },
    {
        "id": "2018-11-23-cracking-code-session-3",
        "name": "Cracking the Coding Interview - Session #3",
        "description": "We hope you enjoyed Cracking the Coding Interview last week! For those of you who weren't able to join us for session #2, a livestream is available in the group below.\n\nJoin us this Friday for session #3, the LAST Fall 2018 session! We will be going over some data structures often relevant in interview questions - hash maps and linked-lists (among others) before moving on to some practice problems. This event is open to students of all skill levels, whether you're experienced with these concepts or not!\n\nIf you haven't already joined the Facebook discussion group for Cracking the Coding Interview, you can find it here.\nFeel free to ask questions in this group! https://www.facebook.com/groups/569650000139322/?ref=br_rs\n\n______________________________\n\nIf your dream company invited you to their offices for a technical interview RIGHT NOW, would you feel well-prepared?\n\nWe invite you to attend \"Cracking the Coding Interview\" — a series of technical interview workshops organized jointly by IEEE uOttawa, CSSA, and SESA, featuring questions from \"Cracking the Coding Interview\" by Gayle McDowell! 💡📖\n\nThe workshops will last 1 hour each, during which experienced mentors will explain and solve certain questions from the book, as well as discuss other interview tips! 📋 The first session will serve as an introduction, and increasingly difficult problems will be discussed in future sessions.\n\nDon't put it off any longer - join us Friday, November 9th at 7PM in CBY B012 for our intro session, and get ready to learn!\n\nSession 1 : Friday, November 9th, 7PM\n\nSession 2: Friday, November 16th, 7PM\n\nSession 3: Friday, November 23rd, 7PM\n\n_______________________________\n\nSi vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?\n\nNous vous invitons à participer à Cracking the Coding Interview – une série d’ateliers (organisée conjointement par IEEE uOttawa, CSSA, et SESA) abordant tout ce qui concerne les entrevues techniques, avec des questions tirées du livre « Cracking the Coding Interview » par Gayle McDowell ! 💡📖\n\nLes ateliers seront d’une durée d’une heure chaque; pendant ce temps, des mentors expérimentés résoudront et vous expliqueront des questions techniques tirées du livre. Les mentors discuteront également de conseils pour des entrevues ! 📋 La première séance servira d'introduction, et des questions de plus en plus difficiles seront abordées lors des futures séances.\n\nN’attendez pas – rejoignez-nous lors de notre séance d’introduction le vendredi 9 novembre à 19h au local CBY B012, et soyez prêts à apprendre !\n\nPremière séance : le vendredi 9 novembre, 19h\n\nDeuxième séance : le vendredi 16 novembre, 19h\n\nTroisième séance : le vendredi 23 novembre, 19h",
        "FR": "Si vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?",
        "url": "https://www.facebook.com/events/290399481613073",
        "image": "../images/events/2018-2019/cracking_code_session_3_2018_11_23.jpg"
    },
    {
        "id": "2018-12-05-puppy-therapy",
        "name": "Puppy Therapy",
        "description": "You need a study break!!\n-Cuddle with pups from Freedom Dog Rescue🐶\n-Hot chocolate☕️\n-Photo booth📸\n\nThe event is FREE, limited to the first 30 registrants and you must RSVP with your uOttawa email on Eventbrite!\n\nWe will be accepting donations for Freedom Dog Rescue💖and yes...some of the pups are adoptable😍",
        "FR": "Vous avez besoin d'une pause d'étude !! \n-Câlin avec les chiots de Freedom Dog Rescue🐶 \n-Chocolat chaud☕️ \n-Photomaton   \n \nL'événement est GRATUIT, limité aux 30 premiers inscrits et vous devez confirmer votre présence avec votre courriel uOttawa sur Eventbrite! \n \nNous accepterons des dons pour Freedom Dog Rescue💖et oui ... certains chiots sont adoptables😍 ",
        "url": "https://www.facebook.com/events/2030513640350484",
        "image": "../images/events/2018-2019/puppy_therapy_2018_12_05.jpg"
    },
    {
        "id": "2019-09-09-IEEE-Ottawa-Aerospace-Engineering-Milestone-Ceremony",
        "name": "IEEE Ottawa Aerospace Engineering Milestone Ceremony",
        "description": "The Ottawa Section of IEEE and the Canada Aviation and Space Museum cordially invite all students to: The dedication of the IEEE engineering milestone “First Search and Rescue Using Satellite Technology, 1982”. \n \n Join us at the museum for this special event, where we will also celebrate space-related technical achievements as part of the commemoration of the fiftieth anniversary of humans landing on the Moon.",
        "FR": "La section d'Ottawa de l'IEEE et le Musée de l'aviation et de l'espace du Canada invitent cordialement tous les étudiants à: La dédicace du jalon d'ingénierie de l'IEEE\" First Search and Rescue Using Satellite Technology, 1982 \". \n \n Rejoignez-nous au musée pour cette spéciale événement, où nous célébrerons également les réalisations techniques liées à l'espace dans le cadre de la commémoration du cinquantième anniversaire de l'atterrissage des humains sur la Lune.",
        "url": "https://www.facebook.com/events/1304033823096857/",
        "image": "../images/events/2019-2020/2019-09-09-IEEE-Ottawa-Aerospace-Engineering-Milestone-Ceremony.jpg"
    },
    {
        "id": "2019-09-22-Fall-Annual-General-Meeting-and-Bi-Election",
        "name": "Fall Annual General Meeting & Bi-Election",
        "description": "The IEEE uOttawa Student Branch will be hosting our Annual General Meeting on Sunday, September 22nd 2019 from 2PM to 4PM in order to discuss by-elections. Location is CBY A04. BY-ELECTIONS: By-elections will be taking place during this AGM for the vacant executive positions of the general election for the 2019-2020 term. These positions will include: Secretary, Commissioner of Translation, Commissioner of WIE Design",
        "FR": "La Branche Étudiante de l'IEEE à uOttawa recevra son Assemblée générale annuelle afin de mener des élections partielles. L'assemblée se passera dimanche le 22 septembre, 2019. L'endroit sera annoncé plus tard.",
        "url": "https://www.facebook.com/events/3398690060141079/",
        "image": "../images/events/2019-2020/2019-09-22-Fall-Annual-General-Meeting-and-Bi-Election.jpg"
    },
    {
        "id": "2019-09-23-EngiBEERing-FALL-2019",
        "name": "EngiBEERing FALL 2019",
        "description": "$0.35 WINGS, $3 BURGERS \n (VEGGIE OPTIONS INCLUDED) \n Start the semester off right with drinks and grub that suit your student budget. Come socialize, eat, drink and dance with your fellow engineers at Patty Boland's Monday, September 23rd!",
        "FR": "0.35 $ WINGS, 3 $  BURGERS (OPTIONS VÉGÉ INCLUSES) Commencez le semestre avec des boissons et de la nourriture qui conviennent à votre budget étudiant. Venez vous socialiser, manger, boire et danser avec vos collègues ingénieurs au lundi 23 septembre chez Patty Bolands !",
        "url": "https://www.facebook.com/events/2420568491397774/",
        "image": "../images/events/2019-2020/2019-09-23-EngiBEERing-FALL-2019.jpg"
    },
    {
        "id": "2019-09-30-Agile-Workshop",
        "name": "Agile Workshop",
        "description": "Come learn more about Agile with Sairam Ramadass. Sairam Ramadass has been working in the IT industry for the last 23 years. His industry experience includes Manufacturing, Finance, Government, Real Estate investment management, Media, Retail, Food etc. He is a certified PMP, Certified Agile practitioner since 2011. He is also Certified DevOps coach and SCRUM trainer. He did his management program at the University of New Brunswick. Since 2018 Sairam is consulting at ESDC as a senior Agile and DevOps coach and trainer.",
        "FR": "Venez nous rejoindre le lundi, 30 septembre 2019 de 18h-17h à EITI - Salle 5084 pour un atelier sur Agile!",
        "url": "https://www.facebook.com/events/401787033817041/",
        "image": "../images/events/2019-2020/2019-09-30-Agile-Workshop.jpg"
    },
    {
        "id": "2019-10-01-IEEE-Day-Celebration-uOttawa",
        "name": "IEEE Day Celebration: uOttawa",
        "description": "Come celebrate the Anniversary of IEEE with the uOttawa student branch. Learn more about uOttawa events, local and international IEEE inniatives and how IEEE membership may benifit you \n And did we mention Free Pizza and a chance to win IEEE Swag?! 💯 \n Presentation and food lasts from 4-4:45 followed by general networking and a Webcast of the IEEE Canada celebrations of IEEE Day!! ",
        "FR": "Venez célébrer l'anniversaire de l'IEEE avec la branche étudiante de l'uOttawa. En savoir plus sur les événements de l'uOttawa, les initiatives locales et internationales de l'IEEE et comment l'adhésion à l'IEEE peut vous être bénéfique \n Et avons-nous mentionné la pizza gratuite et une chance de gagner le Swag IEEE ?! 💯 \n La présentation et la nourriture durent de 4 h à 16 h 45, suivies d'un réseautage général et d'une webdiffusion des célébrations de la journée de l'IEEE de l'IEEE Canada !! ",
        "url": "https://www.facebook.com/events/474453996483349/",
        "image": "../images/events/2019-2020/2019-10-01-IEEE-Day-Celebration-uOttawa.jpg"
    },
    {
        "id": "2019-10-30-Hallo-Wii-n-Tournament-and-Treats",
        "name": "Hallo-Wii-n Tournament and Treats",
        "description": "Spooky season is among us and what better way to spend than with your BFFs Mario and Luigi??? \n Join us in the IEEE office on October 30th for a wholesome Wii tournament and some spooky snacks. \n Scariest thing of all? It's COMPLETELY FREE!!",
        "FR": "Quelle est la meilleure façon de s'amuser cette saison fantasmagorique? Avec Mario et Luigi, bien sûr! Rejoignez-nous au bureau de l'IEEE le 30 octobre pour un tournoi sain sur la Wii et des collations fantasmagoriques. Le plus effrayant de tous? C'est totalement gratuit!",
        "url": "https://www.facebook.com/events/536019240533404/",
        "image": "../images/events/2019-2020/2019-10-30-Hallo-Wii-n-Tournament-and-Treats.jpg"
    },
    {
        "id": "2019-11-18-Women-In-Tech-Panel",
        "name": "Women In Tech Panel",
        "description": "Now's your chance to hear and network with some of the most inspiring and accomplished women in tech!👩‍💻🗣️ After the panel, there will be a networking session with the panelists and other industry professionals!🚀 The event is open for EVERYONE to come and includes FREE FOOD😋 \n Ne ratez pas l’occasion de rencontrer et de réseauter avec quelques-unes des femmes les plus inspirantes et accomplies dans le domaine de la technologie!👩‍💻🗣️ La session de réseautage aura lieu après le panel avec les autres professionnels de l’industrie! 🚀 L’évènement est ouvert à TOUT LE MONDE, et il y aura de la NOURRITURE GRATUITE!😋",
        "FR": "Ne ratez pas l’occasion de rencontrer et de réseauter avec quelques-unes des femmes les plus inspirantes et accomplies dans le domaine de la technologie!👩‍💻🗣️ La session de réseautage aura lieu après le panel avec les autres professionnels de l’industrie! 🚀 L’évènement est ouvert à TOUT LE MONDE, et il y aura de la NOURRITURE GRATUITE!😋",
        "url": "https://www.facebook.com/events/537231713776451/",
        "image": "../images/events/2019-2020/2019-11-18-Women-In-Tech-Panel.jpg"
    },
    {
        "id": "2019-11-27-Cookies-n-Cram",
        "name": "Cookies n Cram: CEG3136 & CEG3155",
        "description": "What's the best way to study for finals? Cookies and Friends!! Join us for our CEG3136 and CEG3155 Cookies n Cram sessions where we will have some upper year students available to help you with questions you may have for the final, as well as delicious cookies!!",
        "FR": "Quelle est la meilleure façon d’étudier pour les examens finaux? Biscuits et Amis!! Rejoignez-nous pour nos séances « Cookies n Cram » pour CEG3136 et CEG3155  ou nous aurons des étudiants d’années supérieures disponibles pour vous aider avec les questions que vous pourriez avoir pour l’examen final, ainsi que des biscuits délicieux!",
        "url": "https://www.facebook.com/events/411238603116907/",
        "image": "../images/events/2019-2020/2019-11-27-Cookies-n-Cram.jpg"
    },
    {
        "id": "2019-11-28-Cookies-n-Cram",
        "name": "Cookies n Cram: CEG2136",
        "description": "What's the best way to study for finals? Cookies and Friends!! Join us for our CEG2136 Cookies n Cram sessions where we will have some upper year students available to help you with questions you may have for the final, as well as delicious cookies!!",
        "FR": "Quelle est la meilleure façon d’étudier pour les examens finaux? Biscuits et Amis!! Rejoignez-nous pour nos séances « Cookies n Cram » pour CEG2136 ou nous aurons des étudiants d’années supérieures disponibles pour vous aider avec les questions que vous pourriez avoir pour l’examen final, ainsi que des biscuits délicieux!",
        "url": "https://www.facebook.com/events/2706536146075559/",
        "image": "../images/events/2019-2020/2019-11-28-Cookies-n-Cram.jpg"
    },
    {
        "id": "2019-11-29-Cookies-n-Cram",
        "name": "Cookies n Cram: ITI1120 & GNG1106",
        "description": "What's the best way to study for finals? Cookies and Friends!! Join us for our ITI1120 and GNG1106 Cookies n Cram sessions where we will have some upper year students available to help you with questions you may have for the final, as well as delicious cookies!!",
        "FR": "Quelle est la meilleure façon d’étudier pour les examens finaux? Biscuits et Amis!! Rejoignez-nous pour nos séances « Cookies n Cram » pour CEG3136 et CEG3155  ou nous aurons des étudiants d’années supérieures disponibles pour vous aider avec les questions que vous pourriez avoir pour l’examen final, ainsi que des biscuits délicieux!",
        "url": "https://www.facebook.com/events/818481171915257/",
        "image": "../images/events/2019-2020/2019-11-29-Cookies-n-Cram.jpg"
    },
    {
        "id": "2019-12-02-Cookies-n-Cram-1",
        "name": "Cookies n Cram: CSI2110 & SEG2105",
        "description": "What's the best way to study for finals? Cookies and Friends!! Join us for our CSI2110 and SEG2105 Cookies n Cram sessions where we will have some upper year students available to help you with questions you may have for the final, as well as delicious cookies!!",
        "FR": "Quelle est la meilleure façon d’étudier pour les examens finaux? Biscuits et Amis!! Rejoignez-nous pour nos séances « Cookies n Cram » pour CSI2110 et SEG2105  ou nous aurons des étudiants d’années supérieures disponibles pour vous aider avec les questions que vous pourriez avoir pour l’examen final, ainsi que des biscuits délicieux!",
        "url": "https://www.facebook.com/events/568965340316257/",
        "image": "../images/events/2019-2020/2019-12-02-Cookies-n-Cram-1.jpg"
    },
    {
        "id": "2019-12-02-Cookies-n-Cram-2",
        "name": "Cookies n Cram: ELG2138",
        "description": "What's the best way to study for finals? Cookies and Friends!! Join us for our ELG2138 Cookies n Cram sessions where we will have some upper year students available to help you with questions you may have for the final, as well as delicious cookies!!",
        "FR": "Quelle est la meilleure façon d’étudier pour les examens finaux? Biscuits et Amis!! Rejoignez-nous pour nos séances « Cookies n Cram » pour ELG2138 ou nous aurons des étudiants d’années supérieures disponibles pour vous aider avec les questions que vous pourriez avoir pour l’examen final, ainsi que des biscuits délicieux!",
        "url": "https://www.facebook.com/events/434811500542463/",
        "image": "../images/events/2019-2020/2019-12-02-Cookies-n-Cram-2.jpg"
    },
    {
        "id": "2020-01-23-IEEE-SPAC-2020",
        "name": "IEEE SPAC 2020",
        "description": "You must be looking to get that next internship right!? Or maybe a new job as a graduate student? The IEEE Student Professional Awareness Conference (SPAC) is a formal dinner (buffet) event that aims to bridge the gap between students and their career goals. SPAC offers students and employers a unique opportunity to network with one another in a professional environment along with professionals and academics representing the fields of Engineering and Computer Science.",
        "FR": "Certainement, tu cherches pour ton prochain stage!? Ou peut-être un nouvel emploi en tant qu’étudiant de deuxième cycle? La conférence IEEE Student Professional Awareness Conference (SPAC) est un dîner officiel (buffet) qui vise à combler l'écart entre les étudiants et leurs objectifs de carrière. SPAC offre aux étudiants et aux employeurs une occasion unique de réseauter dans un environnement professionnel avec des professionnels et des universitaires représentant les domaines de l'ingénierie et de l’informatique.",
        "url": "https://www.facebook.com/events/706341783179994/",
        "image": "../images/events/2019-2020/2020-01-23-IEEE-SPAC-2020.jpg"
    },
    {
        "id": "2020-01-26-Student-Branch-Meeting-12",
        "name": "Student Branch Meeting #12",
        "description": "Want to get involved with the branch or see what we are working on? Come attend our branch meeting and get involved! Executive meetings of the student branch are open to all students. for more information, please contact the branch.",
        "FR": "Vous voulez vous impliquer à la section ou voir sur quoi nous travaillions? Viens assister à la rencontre et implique toi avec la section! Les rencontres executives de la section étudiante sont ouvertes à tout les étudiants. Pour plus d’information, veuillez contacter la section.",
        "url": "https://www.facebook.com/events/225831395081274/",
        "image": "../images/events/2019-2020/2020-01-26-Student-Branch-Meeting-12.jpg"
    },
    {
        "id": "2020-01-27-Minecraft-Monday",
        "name": "Minecraft Monday",
        "description": "ARE YOU MINECRAFTY ENOUGH??? \n Teams of 4 will compete for the \" ULTIMATE CRAFTER \" title. Each team will have the same amount of time to complete 4 tasks. The first to complete them all will be crowned the winner.",
        "FR": "ES-TU MINECRAFTY??? \n Des équipes de 4 s'affronteront pour le titre de «Crafter Ultime». Chaque équipe aura le même montant de temps pour accomplir 4 défis. Le premier à terminer sera couronné vainqueur.",
        "url": "https://www.facebook.com/events/501021027208917/",
        "image": "../images/events/2019-2020/2020-01-27-Minecraft-Monday.jpg"
    },
    {
        "id": "2020-01-29-Ciena-Open-House",
        "name": "Ciena Open House",
        "description": "Have you heard of Ciena before? Ciena is a global supplier of telecommunications networking equipment, software and services founded in 1992.One of the leading tech giants in Kanata, the IEEE Ottawa branch is giving students an inside look at Ciena’s facilities. Come join us on January 29th, have some food, and maybe walk away with an internship or a full time job!",
        "FR": "As-tu déjà entendu parler de Ciena? Fondé en 1992, Ciena est un fournisseur global d'équipement de réseau de télécommunications, de logiciels et de services. C'est un des géants de Tech à Kanata et la succursale de l'IEEE Ottawa donné aux étudiants un aperçu à l'intérieur des installations de Ciena. Venez nous rejoindre le 29 janvier, mangez de la bouffe, et ressortez possiblement avec un stage ou un emploi à temps plein!",
        "url": "https://www.facebook.com/events/459756808037906/",
        "image": "../images/events/2019-2020/2020-01-29-Ciena-Open-House.jpg"
    },
    {
        "id": "2020-01-30-Introduction-to-Golang-(Go)-Workshop",
        "name": "Introduction to Golang (Go) Workshop",
        "description": "Ever heard of (Go)lang and wanted to know more about it? Come by and learn some valuable tools in golang and how to use it in your projects.",
        "FR": "Avez-vous déjà entendu parler de (Go)lang? Si vous voudrez en-apprendre plus à propos des outils en Golang afin de les utiliser dans vos projets.",
        "url": "https://www.facebook.com/events/902161386853721/",
        "image": "../images/events/2019-2020/2020-01-30-Introduction-to-Golang-(Go)-Workshop.jpg"
    },
    {
        "id": "2020-02-11-IEEE-Coding-Challenge-Winter-2020",
        "name": "IEEE Coding Challenge Winter 2020",
        "description": "Come out to the IEEE office on Tuesday February 11th for a one hour coding challenge.",
        "FR": "Venez au bureau de l'IEEE le mardi 11 février pour un défi de programmation d'une durée d'une heure.",
        "url": "https://www.facebook.com/events/288365335454811/",
        "image": "../images/events/2019-2020/2020-02-11-IEEE-Coding-Challenge-Winter-2020.jpg"
    },
    {
        "id": "2020-02-24-Iti1121-Review-Session-Java",
        "name": "Iti1121 Review Session - Java",
        "description": "Not ready for your ITI1121 midterm? Come to STE 5084 on Monday, January 24th 2020 from 5:30 PM-7:30 PM where we will go over some key concepts for your exam!",
        "FR": "Pas prêts pour votre mi-session de ITI 1121/1521? Venez au SITE 5084 le lundi 24 Janvier de 17h30 à 19h30 où nous allons couvrir des concepts clés pour votre examen!",
        "url": "https://www.facebook.com/events/2599043800194188/",
        "image": "../images/events/2019-2020/2020-02-24-Iti1121-Review-Session-Java.jpg"
    },
    {
        "id": "2020-02-28-Dog-Therapy",
        "name": "Dog Therapy",
        "description": "Ever admire a stranger’s dog and wish to pet it ? Or simply need some love from a dog? IEEE, CSSA, and SESA have worked together to bring you Dog Therapy! At CBY A04 at 12pm on February 28th, we have partnered with Freedom Dog Rescue to help raise money for dogs without a home! There will be coffee, tea, and snacks available for everyone so feel free to come by and destress with the good boys and girls of Freedom Dog Rescue! Donations of any kind would be appreciated and all proceeds will go directly to Freedom Dog Rescue!",
        "FR": "Avez-vous déjà admiré le chien d’un étranger et souhaité le caresser ? Ou simplement besoin de l’amour d’un chien ? IEEE, CSSA et SESA ont travaillé ensemble pour vous apporter la thérapie canine ! Au CBY A04, à 12 h, le 28 février, nous nous sommes associés à Freedom Dog Rescue pour aider à collecter des fonds pour des chiens sans foyers ! Il y aura du café, du thé et des collations pour tout le monde, alors n’hésitez pas à venir vous déstresser avec les bons chiens et les bonnes chiennes de Freedom Dog Rescue ! Nous serions reconnaissants des dons de toutes sortes et tous les bénéfices iront directement à Freedom Dog Rescue !",
        "url": "https://www.facebook.com/events/490331604962893/",
        "image": "../images/events/2019-2020/2020-02-28-Dog-Therapy.jpg"
    },
    {
        "id": "2020-03-02-EngiBEERing",
        "name": "EngiBEERing",
        "description": "JOIN US FOR $0.45 WINGS !! reading week is over and exams are just around the corner- come cry over some beer and wings with us!",
        "FR": "REJOIGNEZ-NOUS POUR DES AILES À 0,45 $ !! La semaine de lecture est terminée et les examens approchent à grands pas. Venez pleurer avec nous en mangeant des ailes et buvant de la bière !",
        "url": "https://www.facebook.com/events/922724771477814/",
        "image": "../images/events/2019-2020/2020-03-02-EngiBEERing.jpg"
    },
    {
        "id": "2020-03-02-ELG-Specialization-Panel",
        "name": "ELG Specialization Panel",
        "description": "Hi everyone! Are you in electrical engineering and about to choose your specialization? Are you confused as to what each one entails, or are struggling to choose between ones you like? Come to the electrical engineering specialization panel on March 2nd at 6pm! We have both graduated and senior students from the faculty of electrical engineering from each specialty here to answer your questions! \n There will be food provided, so bring your questions and enthusiasm!",
        "FR": "Salut à tous ! Êtes-vous en génie électrique et sur le point de choisir votre spécialisation ? Êtes-vous incertains quant à ce qu’implique chacune des spécialisations, ou avez-vous du mal à choisir entre celles qui vous plaisent ? Venez à la table ronde de spécialisation en génie électrique le 2 mars à 18 h ! Des étudiants seniors et des anciens de la faculté de génie électrique de chaque spécialisation seront présents pour répondre à vos questions ! \n La nourriture sera fournie, donc amenez vos questions et votre enthousiasme !",
        "url": "https://www.facebook.com/events/2316505151979961/",
        "image": "../images/events/2019-2020/2020-03-02-ELG-Specialization-Panel.jpg"
    },
    {
        "id": "2020-03-05-Elections",
        "name": "IEEE Elections 2020",
        "description": "IEEE Elections are here!",
        "FR": "Les Élections de l’IEEE sont arrivées!",
        "url": "https://www.facebook.com/events/3054129084599547/",
        "image": "../images/events/2019-2020/2020-03-05-Elections.jpg"
    },
    {
        "id": "2020-03-05-Wine-and-Cheese",
        "name": "11th Annual Wine and Cheese",
        "description": "Introducing IEEE Women in Engineering 11th annual Wine and Cheese. A fantastic opportunity for students to practice their networking skills and build a network with industry professionals and academia from the Ottawa community.",
        "FR": "La 11 ième annuelle soirée Vin et Fromage (organisée par IEEE Women In Engineering) est une excellente opportunité pour les étudiants d'établir des connexions avec des professionnels de l'industrie en provenance de partout en Ottawa.  ",
        "url": "https://www.facebook.com/events/1526709784147976/",
        "image": "../images/events/2019-2020/2020-03-05-Wine-and-Cheese.jpg"
    },
    {
        "id": "2020-09-23-big-eng-little-eng",
        "name": "Big Eng, Little Eng",
        "description": "EVERYONE is welcome to attend this event (mentorship applications not required to attend). If you are interested in signing up for Big Eng Little Eng Mentorship (all students welcome): https://forms.gle/NomAoGHnossk8LZC7 \n\nDon't know what Big Eng Little Eng is? Fear not! You've come to the right place. BELE is a mentorship program for first-year students to get adjusted to life at university. All first years get paired up with an upper year (ideally in the same discipline) so they've got someone to help guide them through the craziness that is first-year engineering. Big eng, Little eng also prepares you with a list of online tools and tips that students only discover after a year at uni!",
        "FR": "Commencez votre eng (Ines) et accélérez votre carrière académique en rencontrant des étudiants et des professionnels innovants en ingénierie! \n\nhttps://forms.gle/NomAoGHnossk8LZC7",
        "url": "https://www.facebook.com/events/975552946253213/",
        "image": "../images/events/2020-2021/big-eng-little-eng.png"
    }
]
