{
    "id": "1878a916-d33a-47a7-83fa-18ec357899ec",
    "positions": [
        {
            "id": "f32bd92e-5acf-47e2-8bb0-a4ffa7ec3169",
            "candidates": [
                {
                    "id": "e9a68b41-de1f-4aa2-aa05-73596a33197d",
                    "user": {
                        "id": "af9b72d3-11e8-4453-ac6a-a0162aaa37f0",
                        "created": "2021-02-22T13:44:48.756514Z",
                        "username": "vjidk018",
                        "email": "vjidk018@uottawa.ca",
                        "name": "Vlad Jidkov",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/af9b72d3-11e8-4453-ac6a-a0162aaa37f0/"
                    },
                    "platform": "Candidate Platform\n\nHey everyone, I’m Vlad!\n\nThis year, I would love to represent you as the IEEE uOttawa Branch Chair. Since I got elected into the branch last year, I instantly fell in love with the association and what it stands for. To me, IEEE means inclusion, acceptance, and collaborative innovation in the electrical engineering and computing community.\n\nThis past year, COVID challenged our uOttawa engineering community in a way that nobody expected. What was meant to be a two-week break from in-person school still hasn’t ended. Even so, we all worked together to keep our community strong. From creating massive Discord chats to hosting virtual events, virtual hangouts, and even creating virtual voting platforms, we used our innovation in a way that no other group of people could. And for that, I’m proud of every single engineer out there. Even the simple act of joining a group chat had a massive impact on preserving our solidarity.\n\nThe transition back to in-person learning provides us with a brand new set of challenges that we, as a group, have to face. It will force us to adapt to our ever-changing academic environment. With this period of transition comes a lot of uncertainty. \n\nThroughout this time of change, I plan to keep one thing consistent. Our collective community as engineering students. I will make sure that, even throughout this period, we maintain as much transparency as possible between the faculty and the students to make this time as stress-free as possible.\n\nAmong this, I plan on keeping our association at IEEE uOttawa a very beneficial and fun environment for anyone that wishes to participate. Here is a list of plans that I have for the next school year.\n\n* Work with the faculty towards opening up our student office in a safe and responsible manner\n* Host tech panels on leading edge technologies such as machine learning and blockchain with Ottawa’s leading professionals.\n* Build an inclusive and inviting environment with the next team of VPs\n* Create association-funded projects (e.g. build a community drone) to expose students to real-world hardware and software applications\n\nI’m always available for any questions or comments at vjidk018@uottawa.ca . Everyone is always welcome to email me.\n\nIn all, I would love to help IEEE uOttawa as an association expand and innovate in our academic community. But I can’t do this without your vote. Help me bring these ideas to life! \n\n#Vote4Vlad",
                    "position": "f32bd92e-5acf-47e2-8bb0-a4ffa7ec3169"
                }
            ],
            "title": "Chair/ Président(e)",
            "description": "One year experience as an exec on the IEEE student branch required. \nPosition description available in our constitution.\n*****************************************************************************\nUne année d'expérience avec la branche étudiante de l'IEEE requise.\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "ea6cfaa6-1bef-42c2-9ae3-3307b909244e",
            "candidates": [
                {
                    "id": "390240c8-a28f-4914-a8a2-02a15ba506e9",
                    "user": {
                        "id": "491b1806-57ac-4239-9b09-c93dfbce7443",
                        "created": "2021-03-15T13:47:43.279839Z",
                        "username": "msmrt084",
                        "email": "msmrt084@uottawa.ca",
                        "name": "Madison Smrtka",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/491b1806-57ac-4239-9b09-c93dfbce7443/"
                    },
                    "platform": "Hello, my name is Madison Smrtka and I will be going into my fourth year of ELG and I am running for the Vice-Chair position of our IEEE uOttawa branch. I have held an exec position on IEEE uOttawa for three years now, as VP Communication (2018), VP Social (2019) and Vice-Chair (2020) and would love to continue on next year in a more leadership role. I have would like to continue to use my position to better organise and inspire our team in order for us to continue to provide you with resources, support and fun social events with a focus on your specific needs during this unprecedented time.\n----------\nSalut, je m'appelle Madison Smrtka et je serais bien tôt dans ma quatrième année en génie électrique et je souhaite être votre vice-présidente de IEEE uOttawa. Durant les trois années précédentes, j'étais VP de communication (2018), VP d'affaires sociales (2019) et Vice-Chair (2020) et j'aimerais assumer un rôle avec plus de qualités de dirigeant. J'espère continuer d’utiliser ma position comme vice-présidente pour améliorer l'organisation et d'inspirer notre équipe pour que nous pourrions continuer d'assurer des ressources, d'appui et des soirées mondaines sur vos besoins spécifiques pendant cette période sans précédent.",
                    "position": "ea6cfaa6-1bef-42c2-9ae3-3307b909244e"
                },
                {
                    "id": "66c8e0ff-d83e-4dc9-9ef2-81ad4a79b39f",
                    "user": {
                        "id": "62f903bf-4008-40a0-87b8-7ca9feaecdfd",
                        "created": "2021-03-15T14:57:59.738665Z",
                        "username": "mkapu060",
                        "email": "mkapu060@uottawa.ca",
                        "name": "Mohit Kapur",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/62f903bf-4008-40a0-87b8-7ca9feaecdfd/"
                    },
                    "platform": "My name is Mohit Kapur, and I am applying for the role of Vice-Chairperson for IEEE uOttawa. Over the last year working as the VP of social affairs, I gained a solid understanding of the organization. As the VP social, I was responsible for outreach within the team was well as the community. I feel having the experience of running events, ranging from a simple movie night to hosting a comedian allowed me to really experience the most out of IEEE so far. My goal in this position is to maintain the high level of coordination within as is already present and I believe my previous experience and understanding of the team will aid me in ensuring the new members are welcome, as well as maintaining the same chemistry with the returning members. Being the Vice-chair, I would be the right hand to the Chair, which is a responsibility I know I can be depended upon for. There will be a high level of transparency between myself and the community, allowing for easy outreach. Overall, this is an extremely promising role, and I cannot wait to experience another year being able to work with this community to help it grow.\r\n\r\n------------------------------------------------\r\n\r\nJe m’appelle Mohit Kapur et je postule pour la position de Vice-Président de l’IEEE uOttawa. Durant mon année dernière comme VP Social, j’ai gagné une connaissance très profonde sur l’organisation et son fonctionnement. Étant VP Social, j’étais responsable de la sensibilisation en sein de l’équipe, mais aussi en sein de la communauté d’étudiants. J’ai confiance qu’avoir de l’expérience d’organiser des événements, soit une simple soirée cinéma ou accueillir un comédien, m’a  permit de découvrir le plus sur l’IEEE jusqu’à ce moment. Mon but pour cette position est de maintenir le haut niveau de coordination comme si, et je crois fortement que mes expériences et connaissances passées vont m’aider à assurer que les nouveaux membres se sentent accueillis, en toute fois gardant une bonne dynamique entre eux et les membres de retour. Étant le Vice-Président, je serais la main gauche du Président ce qui est une responsabilité que je peux être assuré avec. Il y a aura un très haut niveau de transparence entre la communauté et moi-même, facilitant donc la sensibilisation. En général, ceci est une position extrêmement prometteuse et je suis ravi de vivre une autre année travaillant au sein de cette communauté, et l’aidant à continuer de se développer.",
                    "position": "ea6cfaa6-1bef-42c2-9ae3-3307b909244e"
                }
            ],
            "title": "Vice Chair/ Vice-Président(e)",
            "description": "One year experience as an exec on the IEEE student branch required. \nPosition description available in our constitution.\n*****************************************************************************\nUne année d'expérience avec la branche étudiante de l'IEEE requise.\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "501d798d-29d1-4631-8922-bf940c72ee59",
            "candidates": [
                {
                    "id": "7c014137-edc9-43f1-beaa-8ce292379cc9",
                    "user": {
                        "id": "ab3baffc-d639-4443-b584-a0b1fb9cfdc4",
                        "created": "2021-03-21T12:16:32.529542Z",
                        "username": "snaya091",
                        "email": "snaya091@uottawa.ca",
                        "name": "Sanat Nayar",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/ab3baffc-d639-4443-b584-a0b1fb9cfdc4/"
                    },
                    "platform": "My name is Sanat Nayar and I am a third year student in Computer Engineering and I wish to be re-elected for Treasurer at IEEE at the University of Ottawa for the 2021/2022 year. \n      I have served as the Treasurer for IEEE UOttawa for the past 2 years and I have learned a lot about what the role entails. I have acquired knowledge relating to the audits, banking regulations, the square invoicing system and the budget making process. I believe the accumulation of experience from the past 2 years will help me become a better treasurer.\n\nMy goals for this next year:\n-Assist in developing a long-term financial plan\n-Invest in long-term, low-risk investments (ex. Guaranteed Investment Certificates (GICs)) for financial sustainability and to gain interest on cash sitting in the IEEE account.\n-Help more efficiently manage company finances to support better and bigger events.\n-Facilitate an incubation process with fellow executives to assist in ideation of effective events that are run with appropriate financing and benefit the students.\n\n      Over the past 3 years, I have culminated a multitude of external experiences that would make me a perfect fit for this role at IEEE. I have been elected the VP of Finance for two student run businesses. In this role, I have learned not only the aspects of finance such as break-even analysis, balance sheets, and cash flow statements, but also how engineering and finance can be easily merged to manage an organization. In one of the student run companies called Swappable, the USP of the company was its platform for transfer of goods and services between students within my High School. Swappable gave me real-life experience on how engineering can be integrated with finance to create a successful product. It also gave me attributes such as money management and the ability to use effective cost-cutting strategies to increase the profits and reduce the liabilities of the company. I believe these experiences and the knowledge I gained from my mentors who initiated the student companies have helped me transition into the role as the treasurer at IEEE and will definitely help in the coming year. \n     IEEE is an association that plays an integral part in the Engineering ecosystem at UOttawa. It is a trustworthy organization that many students and staff lookup to for new information, events and competitions. In order for it to run efficiently, finances have to be managed properly and costs must be accounted for. Based on my past experiences and my passion to contribute to the IEEE platform, I believe I am the ideal candidate for this position. \n\n***** French:\nJe m’appelle Sanat Nayar et je suis un étudiant de troisième année en ingénierie informatique et j’aimerais être réélu comme trésorier à l'IEEE à l'Université d'Ottawa pour l'année 2021/2022.\n   \tAu cours de l’année dernière, j'ai été trésorier de l'IEEE UOttawa et j'ai beaucoup appris sur ce qu'implique ce rôle. J'ai acquis des connaissances relatives aux audits, à la réglementation bancaire, au système de paiement Square et au processus budgétaire. Je crois que l'accumulation de mes expériences au cours de l’année dernière me feront un encore meilleur trésorier.\n\nMes objectifs pour l'année prochaine:\n\n -Investir dans des investissements à long terme et à risque faible (ex. Certificats de placement garanti (CPG)) pour la viabilité financière et pour gagner des intérêts sur l’argent restant dans le compte IEEE.\n -Aider à gérer les finances de l'entreprise plus efficacement pour parrainer des événements meilleurs et plus grands.\n -Faciliter un processus d'incubation avec les cadres pour aider à la idéation d'événements efficaces qui sont gérés avec un financement approprié et qui est avantageux pour les étudiants.\n\nAu cours des 3 dernières années, j'ai culminé une multitude d'expériences externes qui me rendraient parfaitement adapté à ce rôle à l'IEEE. J'ai été élu vice-président des finances pour deux entreprises dirigées par des étudiants. Dans ce rôle, j'ai appris non seulement les aspects de la finance comme l'analyse de rentabilité, les bilans et les états des flux de trésorerie, mais aussi comment l'ingénierie et la finance peuvent être facilement mis ensemble pour gérer une organisation. Dans une des entreprises gérées par des étudiants appelée Swappable, l'USP de l'entreprise était sa plate-forme pour le transfert de biens et de services entre les étudiants de mon école secondaire. Swappable m'a donné une expérience réelle sur la façon comment l'ingénierie peut être intégrée avec la finance pour créer un produit génial. Cela m'a aussi donné des attributs tels que la gestion de l'argent et la capacité d'utiliser des stratégies de réduction des coûts pour augmenter les bénéfices et réduire les passifs de l'entreprise. Je crois que ces expériences et les connaissances que j'ai obtenus de mes mentors qui ont initié les entreprises étudiantes m'ont aidé à passer au poste de trésorier de l'IEEE et m'aideront certainement au cours de l'année à venir.\n        L'IEEE est une association qui joue un rôle intégral dans l'écosystème du génie à l'Université d'Ottawa. Il est une organisation digne de confiance que de nombreux étudiants et membres du personnel consultent pour de nouvelles informations, des événements et des concours. Pour fonctionner efficacement, les finances doivent être gérées proprement et les coûts doivent être pris en compte. Sur la base de mes expériences passées et de ma passion pour contribuer à la plateforme IEEE, je crois que je suis le candidat idéal pour ce poste.",
                    "position": "501d798d-29d1-4631-8922-bf940c72ee59"
                },
                {
                    "id": "334ba796-eb3d-4ca2-af42-b59c2b0221c8",
                    "user": {
                        "id": "19508232-c0a2-476b-b685-b475c0be764f",
                        "created": "2021-03-21T13:59:45.410454Z",
                        "username": "bflyn037",
                        "email": "bflyn037@uottawa.ca",
                        "name": "Benjamin Flynn",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/19508232-c0a2-476b-b685-b475c0be764f/"
                    },
                    "platform": "Name: Benjamin Flynn\r\nProgram: BAC in Software Engineering\r\nYear of study: 2nd \r\n\r\nAs a long-time admirer of the impressive work being done by the IEEE team, I am delighted to submit my application for treasurer. I am currently in my second-year of software engineering at uOttawa and being part of IEEE has been an interest of mine for quite some time now. In multiple of my previous work experiences, I have dealt with finances so what better position to apply for than treasurer. Thus, I am aware of the attention to detail and responsibilities associated with the position and I believe my skill set will be a great asset to the team. \r\n\r\nFor example, I was responsible in my previous position for doing inventory and handling the money that was made every day.  This also included giving notes and predictions to the staff making the product on how much product to bring to the market. This process helped save a lot of money since we would barely waste any product. This experience will very much help with things like writing a projected budget at the beginning of the term or Completion and submission of account audit to the ESS.\r\n\r\nI have greatly enjoyed my time at the University of Ottawa so far and with Covid - 19 turning everyone's life upside down including my own I have been looking for a way to get more involved with the school. Therefore, I very grateful for this opportunity.",
                    "position": "501d798d-29d1-4631-8922-bf940c72ee59"
                }
            ],
            "title": "Treasurer/ Trésorier",
            "description": "Position description available in our constitution.\n*****************************************************************************\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "5b641e97-dfc1-4f3f-8ba0-539f2a5d8d2d",
            "candidates": [
                {
                    "id": "925851db-a38c-48f7-b6bb-63660ab6092a",
                    "user": {
                        "id": "88a80961-06a8-4ec0-a848-e22a066a090b",
                        "created": "2021-03-06T04:33:59.951515Z",
                        "username": "rroma016",
                        "email": "rroma016@uottawa.ca",
                        "name": "Rikki Romana",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/88a80961-06a8-4ec0-a848-e22a066a090b/"
                    },
                    "platform": "Hi! I’m Rikki Romana (she/her), a second-year Electrical Engineering & Computing Technology student, and I am running for IEEE VP Academic! Since coming to university, I’ve been involved in ESS as the first-year representative, I’ve attended ESSCO conferences, and I’m currently the ESS electrical engineering representative for my cohort. \r\n\r\nStudent academic support and advocacy have always been super important to me. During this COVID-19 pandemic, the quality of education has dramatically decreased, so I’m running for VP Academic because I want to help improve EECS students’ academic experience. I’ve been in constant communication with EECS students this year, so I know and understand the academic concerns and complaints from students to voice to the faculty. As VP Academic I will communicate with both students and faculty to ensure the quality of education.\r\n\r\nAdditionally, I’ve worked with ESSCO this year, where I helped research equity, diversity, inclusivity and academic/mental health resources in Ontario Engineering institutions. Through this research, we found that engineering students believe that the academic resources offered at their school are not very accessible. I’ve also learned that the engineering student body is very diverse, and many students are neurodivergent and have mental illness/health issues. As VP Academic, my focus is to make the academic resources more accessible to EECS students virtually and at the McNaughton Centre. I also aim to create more academic and mental health resources for underrepresented groups and people who are neurodivergent/have a mental illness to help promote equity, diversity, and inclusivity in our Faculty.\r\n\r\nFinally, I believe in the importance of encouraging learning outside of the classroom. As VP Academic, I aim to organize academic events and workshops that will help students expand their skills. I also aim to help improve IEEE’s Cookies and Cram study sessions and make the study resources more available to students.\r\n\r\nWhy am I the ideal candidate for this position?\r\n•\tI’ve been involved with student politics since high school and have been part of the ESS Board of Directors since my first year, so I’m very comfortable with attending meetings, and I know how to effectively represent and reach out to students.\r\n•\tI’m a Microsoft Learn Student Ambassador. In this role, I’ve gained experience running workshops for students!\r\n•\tI’m a very passionate person, and I will be fully committed to the VP Academic role.\r\n\r\n----------------------------------------------------------------------\r\n\r\nSalut! Je m’appelle Rikki Romana (elle / lui), une étudiante de deuxième année en ELG et CTI, et je suis candidat à l'IEEE VP Academic! Depuis mon arrivée à l’université, j’ai été impliqué dans l’AÉG en tant que représentant de première année, j’ai assisté à des conférences CAÉGO et je suis actuellement le représentant AÉG de mon cohorte en génie électrique.\r\n\r\nLe soutien scolaire et le plaidoyer des étudiants ont toujours été très importants pour moi. Au cours de cette pandémie de COVID-19, la qualité de l’éducation a considérablement diminué, je me présente donc à titre de vice-président académique parce que je veux aider à améliorer l’expérience académique des étudiants EECS. J'ai été en communication constante avec les étudiants de l'EECS cette année, donc je connais et comprends les préoccupations académiques et les plaintes des étudiants pour faire entendre leur voix à la Faculté. En tant que vice-président académique, je communiquerai avec les étudiants et les professeurs pour assurer la qualité de l'éducation.\r\n\r\nDe plus, j’ai travaillé avec CAÉGO cette année, où j’ai contribué à la recherche sur l’équité, la diversité, l’inclusion et les ressources universitaires / en santé mentale dans les établissements d’ingénierie de l’Ontario. Grâce à cette recherche, nous avons constaté que les étudiants en génie estiment que les ressources académiques offertes dans leur école ne sont pas très accessibles. J'ai également appris que le corps des étudiants en génie est très diversifié et que de nombreux étudiants sont neurodivergents et ont des problèmes de santé / maladie mentale. En tant que vice-président aux études, mon objectif est de rendre les ressources académiques plus accessibles virtuellement aux étudiants de l'EECS et au McNaughton Center. Je vise également à créer plus de ressources universitaires et en santé mentale pour les groupes sous-représentés et les personnes neurodivergentes / atteintes de maladie mentale afin de contribuer à promouvoir l'équité, la diversité et l'inclusion dans notre faculté.\r\n\r\nEnfin, je crois en l'importance d'encourager l'apprentissage en dehors de la salle de classe. En tant que vice-président académique, je vise à organiser des événements académiques et des ateliers qui aideront les étudiants à développer leurs compétences. Je vise également à aider à améliorer les sessions d’étude sur les « Cookies and Cram » de l’IEEE et à rendre les ressources d’étude plus accessibles aux étudiants.\r\n\r\nPourquoi suis-je le candidat idéal pour ce poste?\r\n\r\n\t• Je suis impliqué dans la politique étudiante depuis le lycée et je fais partie du conseil d’administration de l’AÉG depuis ma première année. Je suis donc très à l’aise pour assister à des réunions, et je sais comment représenter et toucher efficacement les étudiants.\r\n\t• Je suis un « Microsoft Learn Student Ambassador ». Dans ce rôle, j’ai acquis de l’expérience en organisant des ateliers pour les étudiants!\r\n\t• Je suis une personne très passionnée et je serai pleinement engagé dans le rôle de vice-président académique.",
                    "position": "5b641e97-dfc1-4f3f-8ba0-539f2a5d8d2d"
                }
            ],
            "title": "VP Academic/ VP Académique",
            "description": "Position description available in our constitution.\n*****************************************************************************\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "dd6f87cc-c850-40b4-89ae-8c2660cc1478",
            "candidates": [
                {
                    "id": "6eb6c0d4-b504-481c-b34a-f4f0ddbdb254",
                    "user": {
                        "id": "1f504069-9d83-4e44-96bf-ddd91813aa6d",
                        "created": "2021-02-25T01:33:49.534900Z",
                        "username": "abouf044",
                        "email": "abouf044@uottawa.ca",
                        "name": "Alae Boufarrachene",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/1f504069-9d83-4e44-96bf-ddd91813aa6d/"
                    },
                    "platform": "⬇ LE FRANÇAIS SUIT ! ⬇\n\n➥Extra-curricular background : \n-Currently representing section H of the first-year Engineering Mechanics course at the ESS.\n-Serving as the current Commissioner of Translations at the IEEE.\n-Member of the SITE Discord Staff (largest student-run server at the Faculty of Engineering).\n-One of the organizers for the upcoming ESSCO PM conference (serving as VP Communications/Marketing).\n\n➥Extra-curricular experience :\n-Attended two CFES conferences : Conference on Diversity in Engineering (CDE) & Canadian Engineering Leadership Conference (CELC). \n-Contributed to this year's ESS Constitution Review committee by putting forward amendment suggestions to reinforce bilingualism within the society.\n\n➥Issues :\n-Being a COVID-era first-year student, I've experienced first-hand the barriers created by our current academic format to get involved and socialize, this disincentivizes students from having access to all the great resources that the IEEE has to offer to EECS students, but I believe that the effects of such barriers can be reduced significantly with the right communications.\n-As one of the only international students part of the IEEE executive team, I’ve noticed that other non-Canadian students don’t get involved in terms of extra-curriculars and student politics as much as their Canadian counterparts (or aren’t even aware of the existence of the IEEE).\n-As your next VP Comms, I will make sure that international EECS students are incentivized to get more involved with the IEEE by showcasing its benefits and the resources it provides, and by putting a strong emphasis on making announcements and performing communications that are well-targeted, compelling, and bilingual.\n\n----------------------------------------------------------------------------------------------------------------------------------\n\n➥Background extra-scolaire :\n-Représentant actuel de la section H du cours de première année de Mécanique pour ingénieurs au sein de l'AÉG.\n-Endosse le rôle de Commissaire aux Traductions au sein de l'équipe exécutive de l'IEEE.\n-Membre du Staff du serveur Discord SITE (plus grand serveur étudiant de la Faculté de Génie)\n-L'un des organisateurs de la prochaine conférence ESSCO PM (endosserai le rôle de vice-président chargé de marketing et des communications)\n \n➥Éxpérience extra-scolaire :\n-Participé à deux conférences de la FCÉG : Conférence sur la Diversité en Ingénierie (CDI) & Conférence Canadienne sur le Leadership en Ingénierie (CCLI).\n-Contibué au conseil de réforme constitutionnelle de l'AÉG en proposant des suggestions d'amendements visant à renforcer la francophonie au sein de l'association.\n\n➥Problématiques :\n-Étant moi-même un étudiant de première année durant la pandémie de COVID, j'ai été directement exposé aux obstacles existants dû au format académique actuel, cela empêche malheuresement la majorité des étudiants internationaux SIGÉ d'avoir accès aux ressources que l'IEEE a à offrir. Mais je pense personnellement qu'il est possible de limiter leurs effets avec des communications adéquates.\n-Étant l'un des seuls étudiants internationaux membre de l'équipe exécutive de l'IEEE, j'ai remarqué qu'il y avait un manque de particiopation au sein de l'IEEE et dans la vie extra-scolaire de manière générale chez les étudiants non-canadiens.\n-Si élu, j'assurerai une bonne représentation des étudiants internationaux au sein de notre organisation en les encourageant à s'impliquer davantage et en les exposant aux atouts de l'IEEE.",
                    "position": "dd6f87cc-c850-40b4-89ae-8c2660cc1478"
                },
                {
                    "id": "bcd77d2b-3d65-4529-93ef-0cc11babbbe7",
                    "user": {
                        "id": "c33989c1-ceeb-4091-a286-be4b1f8e8be3",
                        "created": "2021-03-05T23:53:47.256140Z",
                        "username": "psale041",
                        "email": "psale041@uottawa.ca",
                        "name": "Pavly Saleh",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/c33989c1-ceeb-4091-a286-be4b1f8e8be3/"
                    },
                    "platform": "Hello! I’m Pavly Saleh. I am running to be your IEEE VP Communications. I believe that I am the ideal candidate for this position. Communication is everything. Being able to communicate effectively is an essential skill. As a trilingual student myself, I am able to efficiently communicate with the English and French-speaking students, as well as those who speak Arabic! \nAs VP Communications, it will be my duty to announce and promote all events organized by IEEE. I take this role with great honour, as seeing our EECS students getting more involved in events and growing in number makes me very proud to be part of this community. While I am inexperienced with being a member of IEEE, I know I will be a valuable addition to the team as I will always thrive to bring constant upbeat energy, along with new ideas. \nSo far, the IEEE have done a wonderful job of communicating to students and members the services they offer. My goal is to continue and to expand upon this in order to ensure all announcements are clearly delivered to students. The IEEE offers various services, scholarships, and events! Making sure students are aware of these benefits is my main priority. As VP Communications, I would ensure transparency, and the collaboration in meaningful events for students.\nIn the words of the great Nelson Mandela, “If you talk to a man in a language he understands, that goes to his head. If you talk to him in his own language, that goes to his heart”. I cannot wait to work with you this year as VP Communications! I’m looking forward to communicating with you!\n\n-----------------------------------------------------------------------------------------------------------------------------------------\n\nSalut! Je suis Pavly Saleh. Je pose ma candidature pour le poste de IEEE VP Communications. Je suis le candidat idéal pour ce poste. La communication est la clé du succès. Être capable de communiquer avec clarté est une compétence essentielle. Étant moi-même un étudiant trilingue, je suis capable de communiquer efficacement avec les étudiants anglophones et francophones, ainsi qu’en arabe! \nEn tant que VP Communications, il sera de mon devoir d'annoncer et de promouvoir tous les événements organisés par l'IEEE. J'assume ce rôle avec grand honneur, car voir nos étudiants de SIGE s'impliquer davantage me rend très fier de faire partie de cette communauté. Bien que je manque d’expérience en tant que membre de l'IEEE, je suis certain que je serai un ajout précieux à l'équipe car je m'épanouirai toujours pour remplir mes fonctions avec énergie et enthousiasme, ainsi qu’introduire des nouvelles idées.\nJusqu'à présent, l'IEEE a fait un excellent travail en communiquant aux étudiants les services qu'ils offrent. Mon objectif est de continuer et de développer cela afin de m'assurer que toutes les annonces sont clairement transmises aux étudiants. L'IEEE offre divers services, bourses et événements! Faire en sorte que les étudiants soient conscients de ces avantages est ma priorité principale. Comme VP Communications, je vais prioriser la transparence, ainsi que la collaboration lors d’événements dédiés aux étudiants.\nDans les paroles de Nelson Mandela, «Si vous parlez à un homme dans une langue qu’il comprend, vous parlez à sa tête. Si vous lui parlez dans sa langue, vous parlez à son cœur». Je me réjouis de travailler avec vous cette année en tant que VP Communications! J'ai hâte de communiquer avec vous!",
                    "position": "dd6f87cc-c850-40b4-89ae-8c2660cc1478"
                }
            ],
            "title": "VP Communications",
            "description": "Position description available in our constitution.\n*****************************************************************************\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "aedc34e0-9acd-4f71-861f-ca0e677a81d9",
            "candidates": [
                {
                    "id": "1f08025a-83a8-408c-943e-4e8e3a0a300a",
                    "user": {
                        "id": "31a2f7fc-819a-44cb-bfac-58aec3c58df3",
                        "created": "2021-03-11T23:00:47.758663Z",
                        "username": "sli330",
                        "email": "sli330@uottawa.ca",
                        "name": "Steven Li",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/31a2f7fc-819a-44cb-bfac-58aec3c58df3/"
                    },
                    "platform": "**Le français suit**\n\nHello, I’m Steven Li, a second-year computer engineering student!\n\nThis year, I’m running for Vice President of Internal Affairs. I would greatly appreciate your vote in this election! \n\nHere’s a list of why I believe I’m most qualified for this position:\n•\tI was previously the Treasurer for Battle Royale 13, a gaming tournament hosted by IEEE Ottawa, and had a hand in many aspects of the event (you may recognize me pinging everyone throughout the event :P).\n•\tI have been involved in many school events such as uOttaHack 3 & 4, so I know what kind of leadership is required to host successful events.\n•\tI am hardworking, punctual, and organized, all of which are key assets for the VP Internal position.\n•\tI have tons of work experience, such as being part of the web team for a government agency, so I know how essential communication is when working in a team.\n•\tI am highly accessible online. If you need me for anything, I got you!\n\nHere’s another list of what I hope to deliver as VP Internal:\n•\tIncrease the number of volunteers throughout our events. Volunteering is one of the best ways to connect with new people and to learn new skills!\n•\tEnsure the Branch Constitution stays up-to-date and upkeeping communications with other internal organizations.\n\nThank you for reading my platform and I hope to have your vote on Election Day! :D\n\nSteven\n\n===\n\nBonjour, je m’appelle Steven Li et je suis un étudiant en deuxième année en génie informatique!\n\nCette année, je suis candidat au poste de Vice-Président des affaires internes. Je vous aimerai inconditionnellement si vous me votez dans cette élection!\n\nVoici une liste de pourquoi je crois que je suis le plus qualifié pour cette position :\n•\tPrécédemment, j’étais le trésorier pour Battle Royale 13, un tournoi de jeux organisé par IEEE Ottawa. J’ai aidé avec beaucoup d’aspects de l’événement (peut-être vous me reconnaîtrez comme le gars qui faisait @everyone tout au long de l’événement :P).\n•\tJ’ai eu l’occasion de participer à de nombreux événements scolaires tel qu’uOttaHack 3 et 4, donc je connais quel type de leadership est requis pour organiser des événements.\n•\tJe suis travailleur, ponctuel et organisé, qui sont tous des atouts clés pour le poste de VP Interne.\n•\tJ’ai beaucoup d’expérience de travail; je fais partie de l’équipe web pour une agence gouvernementale.\n•\tJe suis très accessible en ligne. Si vous m'avez besoin pour quoi que ce soit, je suis là!\n\nVoici une autre liste de ce que j'espère de livrer comme VP Interne :\n•\tAugmenter le nombre de volontaires lors des événements. Le bénévolat est l’une des meilleures façons de rencontrer de nouvelles personnes et d’acquérir des nouvelles compétences!\n•\tS’assurer que la constitution de la branche est mis-à-jour et maintenir les communications avec les autres organisations internes.\n\nMerci d’avoir lu ma plateforme et j’espère d'avoir votre vote le jour des élections! :D\n\nSteven",
                    "position": "aedc34e0-9acd-4f71-861f-ca0e677a81d9"
                }
            ],
            "title": "VP Internal/ VP Interne",
            "description": "Position description available in our constitution.\n*****************************************************************************\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "2ab51c2b-980a-4376-a427-33d0cba479b7",
            "candidates": [
                {
                    "id": "d35b959c-5af1-4df3-8393-2ec60fe8120e",
                    "user": {
                        "id": "1f8f0a0e-f40e-4ccf-8428-687564084cab",
                        "created": "2021-03-16T22:27:57.837420Z",
                        "username": "ajafr067",
                        "email": "ajafr067@uottawa.ca",
                        "name": "Ali Jafri",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/1f8f0a0e-f40e-4ccf-8428-687564084cab/"
                    },
                    "platform": "Hi, I'm Ali Jafri and I'm running to be your vice president of social affairs for the 2020-2021 school year. As a fellow engineering student, I have been involved in many school activities such as the UOttawa hackathon, co-lead of the 13th uOttawa-CarletonU battle royale and was even the VP internal for the IEEE. From my past experiences, I have seen the kind of leadership our school needs.\n\nWhat I intend to do:\n\n- Make Frosh week the best it's ever been for EECS students \n\n- Organizing and implementing all social events for members of IEEE.\n\n- To work closely with ESS and CSSA to ensure events are promoted as well as possible.\n\n- Facilitate an incubation process with fellow executives to assist in ideation of effective events that are run with appropriate financing and benefit the students.\n\n- Most importantly, I will be studying and solving student’s problems and difficulties and adopting necessary policies and strategies \n\nAs an all-accelerated student, I am hardworking and organized which are vital qualities for a VP social. If elected, I believe that I could bring new ideas and perspectives into the IEEE and am determined to work hard. I will make sure to organize fun events that will help raise awareness of IEEE to EECS students and allow them to become more involved with the organization. I promise to go above and beyond by planning and supervising the execution of extra-curriculum activities in order to have more brilliant intellectual, cultural and revolutionary activities for all engineering students.\n\nTo make all these things a reality, make sure to vote Ali Jafri as the VP Social. I will be counting on your vote and thank you for reading my platform.",
                    "position": "2ab51c2b-980a-4376-a427-33d0cba479b7"
                }
            ],
            "title": "VP Social",
            "description": "Position description available in our constitution.\n*****************************************************************************\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "146f0fb8-e0bf-4b23-b4f0-0668e922af35",
            "candidates": [
                {
                    "id": "71628fef-36ee-42f5-87eb-3230cc2bd05d",
                    "user": {
                        "id": "dcede9c4-3e7c-4589-a454-3a8252eacdb1",
                        "created": "2021-02-24T19:19:41.627745Z",
                        "username": "jkand011",
                        "email": "jkand011@uottawa.ca",
                        "name": "Loic K",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/dcede9c4-3e7c-4589-a454-3a8252eacdb1/"
                    },
                    "platform": "[Le français suit]\n\nHello all,\nMy name is Jean Loic Kandikandi and I would like to run for the VP Webmaster position in the upcoming IEEE uOttawa student branch election.\n\nI am a bilingual second-year software engineering student currently on my 2nd coop work term as a Web Developer with the Department of Family Medicine of University of Ottawa. With my current role, designing, prototyping, developing and testing are part of my daily tasks. I am also on the software engineering team at Software For Love, a charitable software solution organization based in Ottawa and previously landed a machine learning research internship at Canada Revenue Agency. \n\nAs Webmaster, I would be responsible for updating the meeting minutes and the budget on the IEEE uOttawa website. My role would also include promoting upcoming events and services offered by our branch on the website. One of my goals as Webmaster is to leverage my design skills to offer a polished look to certain pages of the website, mainly the events and gallery pages, to improve the user experience. I am confident that my Web Development experience and skills will work hand in hand to maintain a regularly updated website designed to help you easily access information.\n\n========================================================================\n\nBonjour à tous,\nMon nom est Jean Loic Kandikandi et j'aimerais me présenter pour la position de VP Webmaster lors de la prochaine élection de la branche étudiante de l'IEEE uOttawa.\n\nJe suis un étudiant bilingue de deuxième année en génie logiciel. Je poursuis actuellement mon deuxième stage de travail coopératif en tant que développeur Web au Département de médecine familiale de l'Université d'Ottawa. Dans mon rôle actuel, la conception, le prototypage, le développement et les tests font partie de mes tâches quotidiennes. Je fais également partie de l'équipe de génie logiciel de Software For Love, une organisation caritative de solutions logicielles basée à Ottawa. De plus, j'ai précédemment obtenu un stage de recherche en apprentissage machine à l'Agence du revenu du Canada. \n\nEn tant que webmaster, je serais responsable de la mise à jour des comptes rendus des réunions et du budget sur le site web du IEEE uOttawa. Mon rôle consisterait également à promouvoir les événements à venir ainsi que les services offerts par notre branche sur le site Web. Un de mes objectifs en tant que webmestre est d’utiliser mes compétences en design pour offrir un look soigné à certaines pages du site web, principalement les pages d'événements et de galerie, afin d'améliorer l'expérience de l'utilisateur. Je suis convaincu que mon expérience et mes compétences en matière de développement Web vont travailler main dans la main pour maintenir un site Web régulièrement mis à jour et conçu pour vous aider à accéder facilement aux informations.",
                    "position": "146f0fb8-e0bf-4b23-b4f0-0668e922af35"
                }
            ],
            "title": "Webmaster",
            "description": "Position description available in our constitution.\n*****************************************************************************\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "ef421480-4d33-4533-b73c-033b6c4e7038",
            "candidates": [
                {
                    "id": "54b37809-ed20-4988-ad38-f202bc4a8dbe",
                    "user": {
                        "id": "9ac20e0a-f089-4212-b298-d2cf7ba6f3d5",
                        "created": "2021-03-10T19:22:18.811839Z",
                        "username": "rbiou032",
                        "email": "rbiou032@uottawa.ca",
                        "name": "Rafi Biouss",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/9ac20e0a-f089-4212-b298-d2cf7ba6f3d5/"
                    },
                    "platform": "Hi there! My name is Rafi Biouss, I am a 4rth year Computer Engineering student who has been involved with uOttawa’s Engineering Student Society for several years and I would like to be your 2021/2022 McNaughton Center Director for the Institute of Electrical and Electronics Engineers. My goal is to improve the state of the lab equipment and encourage inclusivity for the McNaughton Centre. I want to create a safe, sanitary, and fun space for all engineers to feel welcome and included.\r\nMy Promises to you\r\n• I will represent the needs of all students and will be available to receive input on all matters involving the McNaughton Centre.\r\n• I will make sure all technology pertaining to students and the institute are well maintained and working. This includes upgrading the labs equipment as well.\r\n• I will make sure all students feel welcome to use the lab frequently as well as ensure the lab rules are followed and respected. Especially when it comes to following sanitation guidelines.\r\nMy Qualifications\r\n• I have been the Vice President of Internal affairs for the ESS the past year and the manager of their social media the year prior\r\n• I have actively gone to most Engineering events and have been especially involved during my previous 101 weeks that I have both attended and guided.\r\n• I have gone to several IEEE events including pi day and truly understand the equipment used within the lab.\r\n\r\n-----------------------\r\n\r\nBonjour à tous ! Je m'appelle Rafi Biouss, je suis un étudiant de 4e année en génie informatique qui participe à l’Association des étudiant(e)s en génie de l'Université d'Ottawa depuis plusieurs années et j'aimerais être votre directeur du Centre McNaughton 2021/2022 pour l'IEEE. Mon objectif est d'améliorer l'état de l'équipement de laboratoire et d'encourager l'inclusivité pour le Centre McNaughton. Je veux créer un espace sûr, sanitaire et amusant pour que tous les ingénieurs se sentent bienvenus et inclus.\r\nMes promesses\r\n- Je représenterai les besoins de tous les étudiants et je serai disponible pour recevoir des commentaires sur toutes les questions concernant le Centre McNaughton.\r\n- Je m'assurerai que toutes les technologies relatives aux étudiants et à l'institut sont bien entretenues et fonctionnent. Cela inclut également la mise à niveau de l'équipement des laboratoires.\r\n- Je veillerai à ce que tous les étudiants se sentent bienvenus dans le laboratoire et à ce que les règles du laboratoire soient suivies et respectées. Surtout quand il s'agit de suivre les directives d'hygiène.\r\nMes qualifications :\r\n- J'ai été le vice-président des affaires internes de l'AÉG l'année dernière et le responsable des médias sociaux l'année précédente.\r\n- J'ai participé activement à la plupart des événements d'ingénierie et j'ai été particulièrement impliqué au cours de mes 101 semaines précédentes, auxquelles j'ai assisté et que j'ai guidées.\r\n- J'ai participé à plusieurs événements de l'IEEE, dont le pi day, et je comprends parfaitement l'équipement utilisé dans le laboratoire.",
                    "position": "ef421480-4d33-4533-b73c-033b6c4e7038"
                },
                {
                    "id": "b42fdf55-ffa1-45b6-9439-99e2fd8008ff",
                    "user": {
                        "id": "216aa520-e564-4be1-88ee-d4564fc86f53",
                        "created": "2021-03-15T17:42:23.587815Z",
                        "username": "avand145",
                        "email": "avand145@uottawa.ca",
                        "name": "Alex Vandici",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/216aa520-e564-4be1-88ee-d4564fc86f53/"
                    },
                    "platform": "My name is Alex Vandici. I am a third-year electrical engineering and computing technology student, and I am running for McNaughton Centre Director. \n\nIn the past, I have worked as an Electrical Test Technologist doing quality control and root cause analysis on custom transformers and Inductors in the aerospace sector. I also have experience working with IEEE Ottawa as the Technical Director for Battle Royale 13. I plan to achieve the following:\n\n•\tSchedule training events to teach students the correct usage of equipment inside the McNaughton Centre.\n•\tEnsure all equipment is properly maintained and calibrated. \n•\tAdvocate for additional industry-standard equipment to be added to the lab, while also applying for grants.\n•\tEnsure that equal opportunity is given to all students wanting to access the lab.\n\nDuring my time as a Test Technologist, I had the opportunity to learn how to use a variety of testing equipment including, but not limited to, source generators, impedance analyzers, LCR bridges, signal generators, dielectric test sets, and corona discharge tests using high voltage equipment. \n\nBecause of my past experience working inside of an aerospace testing environment and working with IEEE Ottawa, I am confident in my ability to uphold the lab standards inside of the McNaughton Centre and to create an environment of learning.\n\nAlex",
                    "position": "ef421480-4d33-4533-b73c-033b6c4e7038"
                }
            ],
            "title": "McNaughton Center Director/ Directeur du Centre McNaughton",
            "description": "Position description available in our constitution.\n*****************************************************************************\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        },
        {
            "id": "398ff194-b784-4adc-a55f-e2e787153854",
            "candidates": [
                {
                    "id": "6d7588fd-743a-4a38-8250-bff4531ce644",
                    "user": {
                        "id": "09cbbf7b-6670-4fd2-b046-d9307b6aa6d7",
                        "created": "2021-03-18T23:42:32.940040Z",
                        "username": "katia095",
                        "email": "katia095@uottawa.ca",
                        "name": "Khaled Atia",
                        "url": "https://sm-democracy-v1.herokuapp.com/api/users/09cbbf7b-6670-4fd2-b046-d9307b6aa6d7/"
                    },
                    "platform": "Name: Khaled Atia\r\nProgram: PhD Electrical Engineering\r\nYear : 3rd\r\nPosition: Photonics-Chair\r\n\r\nMy name is Khaled Atia. I am a PhD student at the University of Ottawa under the supervision of Prof. Hanan Anis. My PhD focuses on Integrated optics for Raman spectrometer. I am writing to express my strong motivation to join the IEEE uOttawa community as photonics-chair. \r\nI am in my third year of my PhD in Electrical Engineering. I joined the University of Ottawa as a visiting researcher in the period 2017-2018, after I finished my master’s degree in time domain modelling of photonic devices from Mansour University, Egypt.\r\nThroughout my research in photonics, I managed to publish 7 articles in prestigious journals, participated in 5 international conferences and published a book chapter. \r\nAs soon as I joined the University of Ottawa, I became an active member in the uOttawa photonics society by helping in planning and organizing photonics related events. I joined the OSA and SPIE uOttawa society to help promoting photonics at the University of Ottawa Community. Throughout my one year of work with the OSA/SPIE photonics chapter, I acquired excellent experience in organizing workshops, events, and social activities. I am currently holding an officer position in the University of Ottawa OSA/SPIE joint chapter. I helped establishing the uOttawa photonics journal club.\r\nI feel as a graduate photonics student that I am responsible for draw the attention of undergraduate student to photonics as a career and to shed the light on the promising future of this field. I believe my experience will help me to achieve that with the right chance.  \r\nBecoming an IEEE executive will provide me with the excellent opportunity to prompt photonics between undergraduate engineers and physicists.  to be part of a dynamic and exciting work force while learning and collaborating with your outstanding team members.",
                    "position": "398ff194-b784-4adc-a55f-e2e787153854"
                }
            ],
            "title": "Photonics Chair/ Président(e) de la Photonique",
            "description": "Graduate students only.\nPosition description available in our constitution.\n*****************************************************************************\nÉtudiants diplômés uniquement.\nDescription de la position disponible dans notre constitution.",
            "election": "1878a916-d33a-47a7-83fa-18ec357899ec"
        }
    ],
    "title": "IEEE Elections/ Élections de l'IEEE",
    "subtitle": "Join IEEE uOttawa! / Rejoignez IEEE uOttawa!",
    "description": "**Traduction Française suit**\n \nAre you interested in taking part in the IEEE uOttawa Student Branch? Nominations for the new 2021-2022 executive positions have opened!\n \nWho can apply: Anyone in Computer Science, Engineering or Science!\n \nFor more details, please refer to the IEEE website: http://www.ieeeuottawa.ca\nAnd the constitution for more details on positions: https://ieeeuottawa.ca/constitution \n\nTo apply:\n- Email elections@ieeeuottawa.ca your full name, student number, program and year of study\n- Submit your 200-500 word platform for the position you’re applying to below (under “Positions”)\n\n*****************************************************************************\nÊtes-vous intéressé à vous impliquer au sein de l’IEEE de l’Université d’Ottawa? Les candidatures pour les postes de l’exécutif sont maintenant ouvertes!\n \nQui peut postuler: Étudiants en Informatique, Ingénierie ou Science\n \nPour de plus amples informations, veuillez consulter notre site web au http://www.ieeeuottawa.ca\nVous pourrez trouver notre constitution et les détails concernant les divers postes au https://ieeeuottawa.ca/constitution \n\nPour postuler : \n- Veuillez envoyer un courriel à elections@ieeeuottawa.ca contenant votre nom complet, votre numéro étudiant, votre programme d'études et année académique \n- Veuillez soumettre votre plateforme de 200~500 mots pour la position à laquelle vous souhaitez vous porter candidat ci-dessous (en-dessous de \"Positions\")",
    "enable_multiple_submissions": false,
    "election_email_domain": "uottawa.ca",
    "public": false,
    "submission_start_time": "2021-03-05T17:00:00Z",
    "submission_end_time": "2021-03-21T16:00:00Z",
    "submission_release_time": "2021-03-22T04:00:00Z",
    "voting_start_time": "2021-03-27T04:00:00Z",
    "voting_end_time": "2021-03-28T16:00:00Z",
    "voting_release_time": "2021-03-28T21:00:00Z",
    "manager": "b35a0339-eecf-4b80-8071-ae6f6016ab9b"
}
