{
    "VP Communications": [
        {
            "name": "Nicholas Morin",
            "program": "Software Engineering",
            "LinkedIn": "https://www.linkedin.com/in/nicholas-morin-13639318a/",
            "FB":"https://www.facebook.com/events/524776285087709/",
            "platform": {
                "en": "<p>Hello, I'm Nicholas Morin. I would like to run for VP Communications in the IEEE for the 2020-2021 term. I am qualified for VP Communications due to my previous experience in the IEEE. I had the great fortune of being part of the IEEE as commissioner of translations during my first year here at the University of Ottawa. Through this experience, I saw what can make or break a communication, what type of marketing resonates with tech enthusiasts such as ourselves, as well as when it is appropriate to insert some humour. As VP communications, I would ensure transparency, the collaboration in meaningful events for students, and education about the frontiers of technology. I’m committed to being there for students who need help in their course. If there’s ever an issue, students should not be afraid to visit the SITE 4026 during my future hours. I hope that this year our team will bring quality events and support for the students that we represent in SEG, CEG, and ELG as a sub-association of the Engineering Students Society. I will seek to work in collaboration with the Faculty and the other student associations such as the CSSA, SESA, and the ESS to make sure events are coordinated and well scheduled. I’m looking forward to writing to you soon, Nich</p>",
                "fr": "<p> Bonjour à tous ! Je suis Nicholas Morin. Je voudrais poser ma candidature pour le poste de VP Communications de l’IEEE pour l’année scolaire 2020-2021. Mon expérience précédente avec le IEEE me qualifie pour ce poste. Pendant ma première année, j’ai eu la chance de faire partie de la division étudiante de l’Université d’Ottawa en tant que commissaire aux traductions. Cette expérience m’a permis de comprendre ce qui peut nuire ou contribuer à une bonne communication, quel type de marketing résonne avec les passionnés de technologie comme nous, ainsi que quand il convient d’insérer un peu d’humour. En tant que maire, je mettrais en priorité la transparence, la collaboration lors d’événements dédiés aux étudiants, ainsi que l’éducation à propos de la technologie de pointe. Je suis voué à toujours être là pour les étudiants qui ont besoin d’aide et j’espère créer un climat de confiance pour que les étudiants se sentent à l’aise de venir me rendre visite pendant mes heures de bureau à SITE 4026 s’ils ont un problème. J’espère de tout cœur que notre équipe mettra sur pied des événements de qualité et un système de soutien pour les étudiants que nous représentons en SEG, CEG et ELG en tant que sous-association de l’association des étudiants en génie. Je m’engagerai à collaborer avec la Faculté ainsi que les autres associations étudiantes du campus notamment AÉI, SESA et l’AÉG afin de m’assurer que les événements sont bien coordonnés et programmés de façon à optimiser le taux de participation. J’espère vous écrire bientôt, Nich </p>"
            }
        },
        {
            "name": "Ajay Modagi",
            "program": "Masters in Electronic Business Technologies",
            "LinkedIn": "https://www.linkedin.com/in/amodagi/",
            "FB":"",
            "platform": {
                "en": "<p>As a first-year master’s student at the University of Ottawa, I am taking courses related to technology, business, entrepreneurship, and project management, to diversify my skillset. Also, I have been actively participating in many competitions and events like CanDev Data Challenge, MakerCon, Concept Submission, and Graduate Poster making. I am volunteering for Centre for Entrepreneurship Education and Development (CEED), Professional Development Club (PDC), IEEE YP, and performing the role of market coordinator for the student association. \n Being actively participating in multiple events and helping coordinate events for the welfare of the students, I nominate myself for the role, V.P. Communication. I will help the association with the management of their communication activities. I will also volunteer to help the association for other roles when required. </p>"
            }
        }
    ],
    "Vice Chair": [
        {
            "name": "Madison Smrtka",
            "program": "Electrical Engineering",
            "LinkedIn": "https://www.linkedin.com/in/madismrtka/",
            "FB":"",
            "platform": {
                "en": "<p> Hello, my name is Madison Smrtka and I will be going into my fourth year of ELG and I am running for the Vice-Chair position of our IEEE uOttawa branch. I have held an exec position on IEEE uOttawa for two years now, as VP Communication and VP Social, and would love to continue on next year in a more leadership role. I have learned a lot the past couple years about team dynamics within the branch as well as the dynamics of you, our audience. I hope to use my position to better organise and inspire our team in order for us to continue to provide you with resources, support and fun social events.</p>",
                "fr": "<p> Salut, je m'appelle Madison Smrtka et je serais bien tôt dans ma quatrième année en génie électrique et je souhaite être votre vice-présidente de IEEE uOttawa. Durant les deux années précédentes, j'étais VP de communication et VP d'affaires sociales et j'aimerais assumer un rôle avec plus de qualités de dirigeant. À travers mes positions précédentes, j'ai appris plein à propos de la dynamique de notre équipe et aussi de vous, notre audience. J'espère utiliser ma position comme vice-présidente pour améliorer l'organisation et d'inspirer notre équipe pour que nous pourrions continuer d'assurer des ressources, d'appui et des soirées mondaines.</p>"
            }
        }
    ],
    "McNaughton Centre Director": [
        {
            "name": "VACANT",
            "program": " ",
            "LinkedIn": " ",
            "FB":"",
            "platform": {
                "en": "<p> Available, voting to be done at IEEE AGM </p>"
            }
        }
    ],
    "VP External": [
        {
            "name": "Alois Clerc",
            "program": "Software Engineering",
            "LinkedIn": "https://www.linkedin.com/in/alois-clerc/",
            "FB":"",
            "platform": {
                "en": "<p>Hey y'all, I'm Alois Clerc, and I'm a first year software engineering student. This year I got my first taste of student society events when I helped organize SPAC(Student Professional Awareness Conference), and I immediately fell in love with the student community here at uOttawa, and I want to keep on doing everything I can to give back to it. As VP External, I would ensure that all of your favorite events such as SPAC, Battle Royale, and WIE Wine and Cheese that require coordination with other IEEE student branches will continue to be happy and healthy and will keep expanding for years to come. I absolutely loved helping organize SPAC this year, so you can count on me to dive right back into SPAC next year so that I can ensure first-hand that one of our largest IEEE uOttawa events of the year runs without a hitch. I also would like to expand our volunteer community at IEEE uOttawa by utilizing more volunteers in our events and motivating the volunteers with a similar reward system to CEED and the uOttawa MakerSpace. The more people involved with IEEE the merrier! Thanks for sticking around and reading my platform, if you liked what you read, I'd appreciate it if you threw a vote my way :)</p>",
                "fr": "<p>Salut à tous, je m'appelle Alois Clerc et je suis un étudiant en première année de génie logiciel. Cette année, j'ai eu ma première expérience avec des événements de la société étudiante quand j'ai aidé à organiser SPAC (Student Professional Awareness Conference), et je suis immédiatement tombé amoureux avec la communauté étudiante ici à l'Université d'Ottawa, et je veux continuer à faire tout ce que je peux pour redonner. à elle. Quand je suis ton VP externe, je m'assurerais que tous vos événements préférés comme SPAC, Battle Royale et WIE Wine and Cheese qui nécessitent une coordination avec d'autres branches étudiantes de l'IEEE continueront d'être heureux et en bonne santé et continueront de se développer pendant des années à venir. J'ai vraiment adoré aider à organiser SPAC cette année, alors vous pouvez compter sur moi pour plonger de nouveau dans SPAC l'année prochaine afin que je puisse m'assurer personnellement que l'un de nos plus grands événements IEEE uOttawa de l'année se déroule sans problème. J'aimerais également élargir notre communauté de bénévoles à l'IEEE uOttawa en utilisant plus de bénévoles dans nos événements et en motivant les bénévoles avec un système de récompense similaire à CEED et au MakerSpace uOttawa. Plus il y a de gens impliqués avec IEEE, mieux nous sommes! Merci de rester et de lire ma plateforme, si vous avez aimé ce que vous avez lu, j'apprécierais que vous jetiez un vote dans ma direction :)</p>"
            }
        },
        {
            "name": "Ali Jafri",
            "program": "Electrical Engineering and Computing Tech",
            "LinkedIn": "https://www.linkedin.com/in/alijafri458/",
            "FB":"",
            "platform": {
                "en": "<p>Hi, I'm Ali Jafri and I'm running to be your vice president of external affairs for the 2020-2021 school year. As a fellow engineering student, I have been involved in many school events such as the UOttawa hackathon and have seen the kind of leadership our school needs. As an all-accelerated student, I am hardworking and organized which are vital qualities for a VP external. If elected, I believe that I could bring new ideas and perspectives into the IEEE and am determined to work hard. I will be the bridge between EECS students and the engineering industry, organize industry-related event as well as coordinate sponsorships for these events. I want to listen to your ideas and opinions on what I could do for you and I want to add more exciting school events to make memories as we move through university. As the vice president of external affairs, I will be sure to be open to all of your ideas and incorporate all of them into the decisions made in the IEEE so everyone's school experience is the best it could be. To make all these things a reality, make sure to vote Ali Jafri as the VP External. I will be counting on your vote and thank you for reading my platform.</p>"
            }
        }
    ],
    "Treasurer": [
        {
            "name": "Sanat Nayar",
            "program": "Computer Engineering",
            "FB":"",
            "LinkedIn": "https://www.linkedin.com/in/sanat-nayar/",
            "platform": {
                "en": "<p> My name is Sanat Nayar and I am a third year student in Computer Engineering and I wish to be re-elected for Treasurer at IEEE at the University of Ottawa for the 2020/2021 year. This past year I have served as the Treasurer for IEEE UOttawa and I have learned a lot about what the role entails. I have acquired knowledge relating to the audits, banking regulations, the square payment system and the budget making process. I believe the accumulation of my experiences over the past year will make me a better Treasurer for 2020/2021. My goals for this next year include: -Continue to push cashless Point-Of-Sale (POS) and cashless transactions through Square. -Investing in long-term, low-risk investments (ex. Guaranteed Investment Certificates (GICs)) for financial sustainability and to gain interest on cash sitting in the IEEE account. -Help more efficiently manage company finances to support better and bigger events. -Facilitate an incubation process with fellow executives to assist in ideation of effective events that are run with appropriate financing and benefit the students. Over the past 3 years, I have culminated a multitude of external experiences that would make me a perfect fit for this role at IEEE. I have been elected the VP of Finance for two student run businesses. In this role, I have learned not only the aspects of finance such as break-even analysis, balance sheets, and cash flow statements, but also how engineering and finance can be easily merged to manage an organization. In one of the student run companies called Swappable, the USP of the company was its platform for transfer of goods and services between students within my High School. Swappable gave me real-life experience on how engineering can be integrated with finance to create a successful product. It also gave me attributes such as money management and the ability to use effective cost-cutting strategies to increase the profits and reduce the liabilities of the company. I believe these experiences and the knowledge I gained from my mentors who initiated the student companies have helped me transition into the role as the treasurer at IEEE and will definitely help in the coming year. I also have experience with various University organizations and event committees. I am currently an Event Coordinator for Software Engineering Student Association (SESA) at UOttawa. I have a multitude of events I have helped organize through this association and some of them were coordinated with IEEE as well. IEEE is an association that plays an integral part in the Engineering ecosystem at UOttawa. It is a trustworthy organization that many students and staff look up to for new information, events and competitions. In order for it to run efficiently, finances have to be managed properly and costs must be accounted for. Based on my past experiences and my passion to contribute the IEEE platform, I believe I am the ideal candidate for this position. </p>"
            }
        }
    ],
    "VP Internal": [
        {
            "name": "VACANT",
            "program": " ",
            "LinkedIn": "",
            "FB":"",
            "platform": {
                "en": "<p> Available, voting to be done at IEEE AGM </p>"
            }
        }
    ],
    "WIE Vice Chair": [
        {
            "name": "Marla Jazzar",
            "program": "Software Engineering",
            "LinkedIn": "https://www.linkedin.com/in/marla-jazzar/",
            "FB":"",
            "platform": {
                "en": "<p>Hello! My name is Marla Jazzar, a second-year Software Engineering student, and I am hoping to represent you as you as your IEEE Women In Engineering Vice-Chair. My experience as VP Academics 2019-2020 has allowed me to truly acknowledge and understand how students can benefit more from IEEE. As WIE Vice-Chair, I will ensure to promote women engineers to follow their educational interests to a profession in engineering. IEEE inspires a global community to innovate for a better tomorrow and I want to be able to represent your voice in this organization! Vote Marla Jazzar for WIE Vice-Chair on March 20th 2020!</p>"
            }
        }
    ],
    "Chair": [
        {
            "name": "Michal Ridner",
            "program": "Electrical Engineering and Computing Tech",
            "LinkedIn": "https://www.linkedin.com/in/michal-ridner-82655a121/",
            "FB":"",
            "platform": {
                "en": "<p>I’m Michal Ridner, a fourth year electrical engineering and computing technology student, and I’m running for Chair for the uOttawa IEEE student branch. I got involved with IEEE two years ago when I served as Secretary and for this past year, I’ve been the Women in Engineering (WIE) Chair. My experiences with IEEE have been amazing and I’ve learned so much about networking and leadership. I had such a good time attending WIE Wine and Cheese last year that I decided to join the WIE team so I could help organize it this year. Cookies n’ Cram is one of my favourite events throughout the year because it gives me the opportunity to help students out with their courses as much as I can and help them learn from my own mistakes. If I were elected Chair, I would apply the skills I’ve developed to make sure that all the great events IEEE runs continue. I would also work on expanding IEEE’s reach within the university. IEEE has so many benefits for undergraduate and graduate students and I want to make sure everyone knows about these opportunities! I would do this by making sure more information about these benefits, such as conferences, scholarships, resources, etc., is posted on our social media as well as promoting them during events. I would also strengthen our relationship with the IEEE Ottawa Section and the IEEE Ottawa Young Professionals. These relationships will help uOttawa students make connections with prominent figures and professionals in industry as well as in academia. I also believe that uOttawa students would benefit from interactions with other universities to build and expand their network. I would cultivate IEEE uOttawa’s relationship with other IEEE student branches across the country, so we could run joint events, whether they be in person or virtual. I would work to make sure IEEE puts on more events that are useful and interesting for you!</p>"
            }
        }
    ],
    "WIE Chair": [
        {
            "name": "Shriya Gundala",
            "program": "Computer Engineering",
            "LinkedIn": "https://www.linkedin.com/in/gshriya/",
            "FB":"",
            "platform": {
                "en": "<p>Hey Everyone! My name is Shriya Gundala, I’m currently in third year Computer Engineering and I am running to be the Women In Engineering (WIE) Vice-Chair for the IEEE uOttawa Student Branch for the 2020-2021 year. Women are underrepresented in the tech world and I want to create a welcoming environment to show that there is a place in tech for every lady out there. There are roughly 30% of women working in the STEM field. It’s up to us women to change that! As Michelle Obama once said, “There is no limit to what we, as women, can accomplish”. <br/> <br/> My goal is to foster an environment for women to excel in the tech industry. Building an inclusive tech community that reflects the diversity of the population is imperative for higher levels of productivity and innovation in all fields. Learning from the influential women before me, empowering the current students, and inspiring the next generation are the driving forces behind running for the Women In Engineering Chair. As the chair, I would be ambitious to bring all these aspects together, and unify all women with aspirations in the industry. I would be honored to be a part of another amazing school-year as the IEEE uOttawa Student Branch and continue to make the success and well-being of every student our utmost priority. <br/> <br/> So why vote for me? <ul> <li> I would like to grow the Big Eng Little Eng mentorship program to not only encourage connections between lower and upper year female undergraduates but also undergraduates with graduates and professional female engineers. </li> <li> I want to broaden and continue to have professionals from different engineering streams at the Annual WIE Wine and Cheese Networking Event. </li> <li> I want to have an outreach program to encourage young women in high school to pursue their passions in STEM.</li> <li> I'd like to hold new and exciting awareness events and opportunities for women in Engineering such as resume review, interview workshops, and panels, as well as host social nights for all to have fun in an inclusive and safe environment. </li> <li> My previous networking and professionals skills at conferences would allow me to represent IEEE’s voice in a professional manner. </li> <li> I’ve been involved in IEEE for one year now, as the Women In Engineering Vice Chair. This upcoming year I would like to take on a leading role with IEEE and I believe being WIE chair would be a wonderful learning experience. </li> <li> The voting period for the IEEE elections is between the 20th and the 21st of March! </li> </ul> </p>"
            }
        }
    ],
    "VP Social": [
        {
            "name": "Mohit Kapur",
            "program": "Electrical Engineering and Computing Tech",
            "LinkedIn": "https://www.linkedin.com/in/mohitxxkapur/",
            "FB":"",
            "platform": {
                "en": "<p>My name is Mohit Kapur and I am a third year electrical engineering student. I am very excited to announce that I am campaigning for the position of VP of social affairs in this year’s IEEE election. While I am inexperienced with being a member of IEEE, I know I will be a beneficial addition as I will bring constant upbeat energy and confidence, along with new ideas. The position of VP of Social affairs entails raising awareness of the IEEE community in uOttawa as well as ensuring morale remains high within the team itself, and these responsibilities are exactly what I aim to achieve. My goals in this position are to spread the word of IEEE and how it will benefit all the students in the faculty of engineering, as well as maintaining the aforementioned level of high morale on the team. Attaining the first goal will not be an easy feat, as there is an ever increasing amount of new engineers beginning the next chapters of their lives at uOttawa. Because I have the privilege of being a student of the uOttawa engineering faculty, I was able to meet and connect with an extremely diverse group of people. I feel that by using these connections, I can amass a large group of students, both new and experienced, to become actively involved with IEEE and the services and activities provided. Having strong outreaching abilities is important, but nothing is more important than having strong connections between team members. Over my high school years, I have taken many leadership roles, ranging from attending various conferences dedicated to becoming a better leader and team player to organizing and running my own fundraiser, and everything in between. By applying said previous leadership experience, I believe I would be able to greatly improve the internal team spirit. I’ve had previous experience with running team building activities in large and small groups alike, and I feel that I have the knowledge required to ensure the team is running at 100%. My final and foremost promise is to ensure these goals are met. To do so, I will work as hard as I can to make the most out of my time as VP of Social affairs by spreading the praises of IEEE as far as I can, while also doing everything in my power to promote healthy relationships between members and council members alike.</p>"
            }
        },
        {
            "name": "Sheena Verana",
            "program": "Computer Engineering",
            "LinkedIn": "",
            "FB":"",
            "platform": {
                "en": "<p> I’m a computer engineering student and I am excited to be running for VP social. I want to be a part of IEEE because I am confident that I can help maintain and build upon its good reputation. As VP social, I’ll promote IEEE by making sure the association is well-represented in engineering events. I’ll ensure to create more opportunities for people to have fun and network, but also have the review sessions, social gatherings and workshops that you know of continue to come. My goal is to get a greater amount students to become more involved with IEEE. You can trust that I’ll try my best as an individual and team member to take on this role to help enhance your student experience! Thank you :)))</p>"
            }
        }
    ],
    "VP Academic": [
        {
            "name": "Vlad (Vladislav Jidkov)",
            "program": "Computer Engineering",
            "LinkedIn": "https://www.linkedin.com/in/vladjdk/",
            "FB":"",
            "platform": {
                "en": "<p>Hi, I’m Vlad. This year, I’m running to be your IEEE Vice President of Academic Affairs. I believe that I am a perfect fit for this position. Here’s why. • I have one year of experience with the Faculty Council and I have another incoming year. This means I’ll already have meetings scheduled with all of the staff on the council, as well as having direct contact with them in case of any issues that need to be immediately brought up. • I have experience in internships, research, and personal projects. This means that along with academics, I’ll be able to assist and guide you if you have any questions about these subjects. • I am passionate about helping others. Whether it be in one of the student associations’ offices or in a group chat, you’re always more than welcome to come talk to me for guidance. • I take problems very seriously. If there is any confusion, a lack of resources in classrooms, or any other issue regarding academic activities, I would be more than glad to come to your help and directly speak to those capable of making a direct change. I’ll be the direct bridge between the faculty and you, the student. I’d love to work with you this year as VP Academic so that we can make education both fun and exciting. Let's work together to make that happen.</p>"
            }
        }
    ],
    "Webmaster": [
        {
            "name": "Ryan Fleck",
            "program": "Computer Engineering",
            "LinkedIn": "https://www.linkedin.com/in/ryan-c-fleck/",
            "FB":"",
            "platform": {
                "en": "<p>My name is Ryan Fleck, and I'd like to become your next IEEE-uOttawa Webmaster. Currently, I am one of two lead programers on the UOE Supermileage/Urban Concept car teams, and finishing up my third year courses. Outside of school, I've completed 16 months of internships at MNP and IBM, and currently work for the Xalgorithms Foundation (an open source/libre software project) part time. As Webmaster, I would be able to apply my varied experience testing, building, and using web content managment systems and applications at MNP and IBM to clearly display the services our branch provides and promoting planned events. In addition, I'd like to create a suite of useful online tools to help uOttawa students contend with scheduling, joining teams, and connecting with subject-matter experts. Having seen the value of applying what we learn in class in the real world, I would work to ensure that discovering and joining the variety of excellent teams that uOttawa funds is made easier than ever.</p>"
            }
        },
        {
            "name": "Sirjan Rekhi",
            "program": "Computer Engineering",
            "LinkedIn": "https://www.linkedin.com/in/sirjansinghrekhi/",
            "FB":"",
            "platform": {
                "en": "<p>Hi, I am a third-year Computer Engineering (B.Eng) student. In my soon to be three years at UOttawa, I have learned skills and grown a lot as a person. I have competed, brain-stormed, innovated, socialized, and given it my all on multiple occasions as a participant. These endeavors have helped me understand life as a student in STEM. As an aspiring engineer, it is imperative to understand life as a professional and build connections in the community. I believe joining the IEEE student body is the best way to achieve this and to help my fellow engineering students as a contributor. My goal is to contribute to the best of my ability. Therefore, I have chosen to run for the position of Webmaster. I have experience with front end web development. I am adept at HTML, CSS, JavaScript, and React. I am an avid learner, so I look forward to the new skills I will learn through and for this role. My work experience has enabled me to work in varied industries and with people from diverse backgrounds, which has translated into exceptional communication and interpersonal skills. As a member of the UOttawa squash team, keeping up with my training and representing the university at tournaments has helped me develop my team-building skills, strengthened my time management, and developed discipline. I believe these skills are essential to be effective in a team, and I am confident in my ability to achieve the technical aspects of the role. I am passionate about making meaningful changes, which is why I chose to study Engineering. I will perform the duties for this role with the same passion if I am elected, and most definitely enjoy doing so! Thank you for your consideration, Sirjan Rekhi</p>"
            }
        }
    ],
    "Photonics Chair": [
        {
            "name": "VACANT",
            "program": " ",
            "LinkedIn": "",
            "FB":"",
            "platform": {
                "en": "<p> Available only for Grad Students, voting to be done at IEEE AGM </p>"
            }
        }
    ],
    "Photonics Vice-Chair": [
        {
            "name": "VACANT",
            "program": " ",
            "LinkedIn": "",
            "FB":"",
            "platform": {
                "en": "<p> Available only for Grad Students, voting to be done at IEEE AGM </p>"
            }
        }
    ]
}
