[
  {
    "id": "2018-10-05-office-trivia-night",
    "name": "BEARS.BEETS.the office trivia",
    "description": "Fact. Cafe Nostalgica is the best place you can spend your Monday night. Scranton will be taking over Ottawa so take a break from being The World's Best Boss, your classes at art school, or beet farming to prove you know the most about the Dunder Mifflin family. I can guarantee that you'll leave satisfied and smiling...that's what she said!\n\nGet ready for a night full of trivia from all the seasons and an ample amount of that's what she said jokes (yeah, it might be a good idea to leave your HR friends at home). Reserve your spot by signing up as a team (of 1-4, $20 per team). The top team will get to take home a Dundie (other prizes will also be available)!\n\nThink you've got what it takes to run Dunder Mifflin Scranton? Or will you settle for Assistant to the Regional Manager? Come join us October 5th, 2017 at Cafe Nostalgica to find out!\n\nFor questions or concerns, please email any of the following:\nHeemel Saha - chair@ieeeuottawa.ca\n\n\n*****\n\nCafe Nostalgica est le meilleur endroit où vous pouvez passer votre lundi soir. Ottawa se transformera en Scranton pour une soirée, alors prenez une pause d'être le meilleur patron du monde, des cours à l'école d'art ou de l'élevage de betteraves pour prouver que vous en connaissez le plus à propos de la famille Dunder Mifflin. Je peux vous garantir que vous quitterez satisfait et souriant ... \"that's what she said!\"\n\nPréparez-vous pour une soirée avec des questions venant de toutes les saisons et plusieurs blagues \"that's what she said\" (ça pourrait être une bonne idée de laisser vos amis HR à la maison). Réservez votre place en vous inscrivant en équipe (de 1-4, 20 $ par coéquipier, lien d'inscription d'équipe à venir). La meilleure équipe recevra un Dundee (d'autres prix seront également disponibles)!\n\nPensez-vous avoir ce qu'il faut pour gérez Dunder Mifflin Scranton? Ou bien serrez vous satisfait avec le poste d'assistant du directeur régional? Venez nous rejoindre le 2 octobre 2017 chez Cafe Nostalgica pour en savoir plus!\n\nPour des questions ou des préoccupations, veuillez envoyer un courriel à l'une des adresses suivantes:\nHeemel Saha - chair@ieeeuottawa.ca",
    "url": "https://www.facebook.com/events/1896432193991285",
    "image": "../images/office_trivia_night_2018_10_05.jpg"
  },
  {
    "id": "2018-09-17-engibeering-wings",
    "name": "EngiBEERing: Wing Night Edition",
    "description": "35 CENT WINGS, $3 BURGERS, $2 FRENCH FRIES, $5 POUTINE UNTIL MIDNIGHT!\n\nWhat's better than drinking away all of your back to school sorrows? Nothing. Come get a beer (or 20) with us and have a good time! The best thing about Patty's is that they have a clubbing section upstairs (pub/bar section is on the main floor). Whether you're excited or stressed for school, you deserve a drink to celebrate the start of a new semester. All students regardless of faculty are welcome.\n\nThis is a 19+ event.\n\nPlease direct all questions to Heemel Saha: chair@ieeeuottawa.ca",
    "url": "https://www.facebook.com/events/1185229758324733",
    "image": "../images/engibeering_wings_2018_09_17.jpg"
  },
  {
    "id": "2018-09-24-google-uo",
    "name": "Google at University of Ottawa",
    "description": "Google is coming to the University of Ottawa on September 24 and 25 to host multiple events over the span of the two days! There will be office hours, a resume/interview workshop, and a coding workshop. All of these events are for you to learn more about life at Google and specific job/internship opportunities Google has for students. There will be food and swag while they last! See the poster for more details and be sure to register as some events have limited capacity:\nhttp://bit.ly/2AOIVoD\n\nGoogle sera présent à l'Université d'Ottawa le 24 et 25 septembre pour organiser plusieurs événements intéressants destinés aux étudiants! Au cours de ces deux jours, il y aura un atelier sur les CVs, un atelier de programmation, et des heures de bureau pendant lesquels vous pouvez bavarder avec des employés de Google. Tous ces événements sont organisés pour vous aider à vous renseigner sur les opportunités professionnelles offertes aux étudiant(e)s par Google, ainsi que la culture professionnelle de Google. Il y aura des rafraîchissements et des cadeaux (tant que disponibles)! Pour vous renseigner davantage, veuiller consulter l'affiche ci-jointe. Assurez-vous de vous y inscrire d'avance, car certains événements ont une capacité limitée: http://bit.ly/2AOIVoD",
    "url": "https://www.facebook.com/events/2049645762013536",
    "image": "../images/google_uo_2018_09_24.jpg"
  },
  {
    "id": "2018-10-02-ieee-day",
    "name": "IEEE Day 2018!",
    "description": "FREE PIZZA!*\nDid we get your attention? Great! IEEE Day is fast approaching and we will be commemorating this anniversary of the first time IEEE members gathered to share their technical ideas in 1884 the way they would've wanted, FREE PIZZA!*\n\nCome hang out with us in the IEEE office on Tuesday October 2nd in STE 4026 to learn more about IEEE and the benefits getting a membership can have!\n\n*while quantities last",
    "url": "https://www.facebook.com/events/2368048349877268",
    "image": "../images/ieee_day_2018_10_02.jpg"
  },
  {
    "id": "2018-09-28-agm-continued",
    "name": "IEEE AGM 2018 (continued)",
    "description": "The IEEE uOttawa Student Branch will be continuing our Annual General Meeting to discuss by-elections and constitution changes.\n\nBY-ELECTIONS:\nBy-elections will be taking place during this AGM for the vacant executive positions of the general election for the 2018-2019 term. These positions will include:\n\nVP Communications\n\nThe following executive positions within the IEEE uOttawa Photonics Student Chapter are also vacant, but please note that their eligibility is limited to GRADUATE STUDENTS ONLY, and strong preference is given to candidates with a specialization in Photonics:\n\nChair, Photonics Student Chapter\nVice-Chair, Photonics Student Chapter\n\nIf you are interested in applying for a position on the 2018-2019 Executive Committee, please email chair@ieeeuottawa.ca with your FULL NAME, STUDENT NUMBER, PROGRAM AND YEAR OF STUDY, and state the position you will be running for. The by-elections will be conducted within the AGM by the executive committee.\n\nAs for your application, you along with the other nominees will be allocated 1-2 minutes during the meeting to give a short speech about yourself and what makes you the best candidate for the position. To prepare for this, I would recommend familiarizing yourself with this role's mandate in the IEEE uOttawa Constitution\n(http://www.ieeeuottawa.ca/files/constitution1.pdf). Afterwards, the executives may ask you a few questions regarding the role, and then have an internal vote with the execs. Results will be released during the meeting.\n\n__________________________\n\nLa Branche Étudiante de l'IEEE à uOttawa continuera son Assemblée générale annuelle afin de mener des élections partielles et d'aborder des changements proposées à sa Constitution.\n\nÉLECTIONS PARTIELLES:\nDes élections partielles auront lieu pendant cette réunion afin de remplir des postes exécutifs vides pour l'année scolaire 2018-2019. Les postes vides consistent des suivants:\n\nV.-P. Communications\n\nDe plus, les deux postes de la Branche Étudiante de la Photonique de IEEE uOttawa sont également vides. Cependant, veuillez noter que SEULEMENT LES ÉTUDIANT(E)S DIPLÔMÉ(E)S peuvent postuler pour ces postes, et qu'une forte préférence sera donnée aux étudiant(e)s diplômé(e)s avec une spécialisation en photonique:\n\nPrésident(e), Branche Étudiante de la Photonique\nVice-Président(e), Branche Étudiante de la Photonique\n\nSi vous souhaitez postuler pour un poste sur le comité exécutif 2018-2019, veuillez envoyer un courriel à chair@ieeeuottawa.ca avec votre NOM AU COMPLET, NUMÉRO ÉTUDIANT, PROGRAMME D'ÉTUDES et ANNÉE D'ÉTUDES, et indiquer le rôle pour lequel vous postulez. Les élections partielles seront menés par le comité lors de la réunion.\n\nEn ce qui concerne votre candidature, vous ainsi que les autre candidat(e)s seront allouées 1 à 2 minutes durant la réunion pour faire un bref discours pendant lequel vous pouvez parler de vous-même et pourquoi vois êtes le/la meilleur(e) candidat(e) pour le poste. Pour vous préparer, il est recommandé que vous vous familiarisez avec le mandat du poste en consultant la Constitution de la Branche (http://www.ieeeuottawa.ca/files/constitution1.pdf). Par après, le comité vous demandera quelques questions par rapport au rôle, et mènera un vote interne. Les résultats du vote seront dévoilés pendant la réunion.",
    "url": "https://www.facebook.com/events/325062718266905",
    "image": "../images/agm_continued_2018_09_28.jpg"
  },
  {
    "id": "2018-10-31-learn-python",
    "name": "SESA x IEEE Python Review Session",
    "description": "PYTHON REVIEW SESSION!!\nWe will help you get the A+ you deserve😉\nWhen: Mon Oct 29 and Wed Oct 31, 5:00-9:00\nWhere: SITE 5084\nThere will be cookies!! 💞🍪",
    "url": "https://www.facebook.com/events/363090764429767",
    "image": "../images/learn_python_workshop_2018_10_31.jpg"
  },
  {
    "id": "2018-11-15-wie-women-tech-panel",
    "name": "IEEE WIE: Women in Tech Panel",
    "description": "IEEE's WIE is excited to host its first annual Women in Tech panel and is welcomed to ALL students! This is an opportunity to hear some of the most inspiring and accomplished women speak about their experiences and their journey to success along with some great career advice to students! On top of that, you'll get to build meaningful connections with the panelists and other industry professionals who are all very excited to meet the students!\n\nTHE EVENT IS FREE AND FREE FOOD WILL BE PROVIDED (After all, we are all students who love free food)\n-------------------------------------------------------------------------------------------\nIEEE est ravi à présenter notre premier annuel panel de Femmes en Technologie. Tous les étudiants sont bienvenus à l'évènement. C'est une occasion d'écouter les histoires des intervenants accomplis à propos de leurs expériences, succès et conseils. De plus, c'est un évènement parfait pour développer des connections avec les panélistes et autres professionnels dans l'industrie. Nous avons hâte de vous avoir et de vous rencontrer.\n\nL’ÉVÈNEMENT EST COMPLÈTEMENT GRATUIT ET LA NOURRITURE EST FOURNIE (Qui n'aime pas la nourriture gratuite ?!)",
    "url": "https://www.facebook.com/events/341275953300827",
    "image": "../images/wie_women_tech_panel_2018_11_15.jpg"
  },
  {
    "id": "2018-11-09-cracking-code-session-1",
    "name": "Cracking the Coding Interview - Session #1",
    "description": "If your dream company invited you to their offices for a technical interview RIGHT NOW, would you feel well-prepared?\n\nWe invite you to attend \"Cracking the Coding Interview\" — a series of technical interview workshops organized jointly by IEEE uOttawa, CSSA, and SESA, featuring questions from \"Cracking the Coding Interview\" by Gayle McDowell! 💡📖\n\nThe workshops will last 1 hour each, during which experienced mentors will explain and solve certain questions from the book, as well as discuss other interview tips! 📋 The first session will serve as an introduction, and increasingly difficult problems will be discussed in future sessions.\n\nDon't put it off any longer - join us Friday, November 9th at 7PM in CBY B012 for our intro session, and get ready to learn!\n\nSession 1 : Friday, November 9th, 7PM\n\nSession 2: Friday, November 16th, 7PM\n\nSession 3: Friday, November 23rd, 7PM\n\n_______________________________\n\nSi vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?\n\nNous vous invitons à participer à Cracking the Coding Interview – une série d’ateliers (organisée conjointement par IEEE uOttawa, CSSA, et SESA) abordant tout ce qui concerne les entrevues techniques, avec des questions tirées du livre « Cracking the Coding Interview » par Gayle McDowell ! 💡📖\n\nLes ateliers seront d’une durée d’une heure chaque; pendant ce temps, des mentors expérimentés résoudront et vous expliqueront des questions techniques tirées du livre. Les mentors discuteront également de conseils pour des entrevues ! 📋 La première séance servira d'introduction, et des questions de plus en plus difficiles seront abordées lors des futures séances.\n\nN’attendez pas – rejoignez-nous lors de notre séance d’introduction le vendredi 9 novembre à 19h au local CBY B012, et soyez prêts à apprendre !\n\nPremière séance : le vendredi 9 novembre, 19h\n\nDeuxième séance : le vendredi 16 novembre, 19h\n\nTroisième séance : le vendredi 23 novembre, 19h",
    "url": "https://www.facebook.com/events/1921377821243067",
    "image": "../images/cracking_code_session_1_2018_11_09.jpg"
  },
  {
    "id": "2018-11-20-coding-challenge",
    "name": "3rd IEEE Coding Challenge",
    "description": "The IEEE Coding Challenge is back for another semester!\n\nCome out to SITE 2060 on Tuesday, Nov. 20th for a one-hour coding challenge.\n\nYou must sign up for the challenge using this link:\nhttps://docs.google.com/forms/d/e/1FAIpQLSckHUd8NJorRMhbgu-isZ3rwxyeYqy6OO5Q4mzvBFtvM0c3Gg/viewform?usp=sf_link\n\nThere will be prizes and fooooood!!\n\nRules:\n- Participants must work individually.\n- Participants will have exactly 1 hour to complete the challenge.\n- The coding challenge will begin at 7:15pm sharp.\n- You may use any programming language.\n\nSolutions will be judged based on algorithm efficiency and the time it takes to complete the challenge.\n\nParticipants will have the chance to discuss the solutions after the challenge and are encouraged to stick around to explain their approach.\n\n---------------------------------------------------------------------------------------\nDéfi de programmation de l’IEEE : édition automne 2018!\n\nPrésentez-vous au local STE 2060 le mardi 20 novembre pour un défi de programmation d'une durée d'une heure.\n\nVeuillez vous inscrire au défi à l’aide du lien suivant :\nhttps://docs.google.com/forms/d/e/1FAIpQLSckHUd8NJorRMhbgu-isZ3rwxyeYqy6OO5Q4mzvBFtvM0c3Gg/viewform?usp=sf_link\n\nIl y aura de la nourriture et des prix!!!\n\nRèglements et contraintes :\n-Les participants doivent travailler de façon individuelle\n-‎Le défi aura une durée d’exactement une heure\n-‎Le défi commencera à exactement 19h15\n-‎En ce qui concerne le langage de programmation utilisé, les participants auront le choix libre\n\nLes critères d’évaluation pour les solutions prendront en compte principalement l'efficacité de l'algorithme et le temps requis pour résoudre le défi.\n\nAprès le défi, les participants auront l'opportunité de discuter de leurs solutions, et sont encouragé(e)s d’expliquer leur méthode utilisée pour résoudre le défi.",
    "url": "https://www.facebook.com/events/1124103607752638",
    "image": "../images/coding_challenge_2018_11_20.jpg"
  },
  {
    "id": "2018-11-07-big-eng-little-eng",
    "name": "Big Eng Little Eng Kickoff!",
    "description": "Start your eng(ines) and accelerate your academic career by meeting innovative engineering students and professionals!\n\nThis is the first official event for IEEE uOttawa WIE's Big Eng Little Eng (BELE) Mentorship Program - EVERYONE is welcome to attend this casual networking event (mentorship applications not required to attend).\n\nIf you are interested in signing up for BELE Mentorship (all students welcome):\nhttps://goo.gl/forms/PKNEvICdl9TUwzW92\n\nDon't know what BELE is? Fear not! You've come to the right place. BELE is a mentorship program for first year studunts to get adjusted to life at university. All first years get paired up with an upper year (ideally in the same discipline) so they've got someone to help guide them through the craziness that is first year engineering.\n\nCome hang out and play some board games and enjoy some hot chocolate after the craziness of midterm season!\n-----------\nCommencez votre eng (Ines) et accélérez votre carrière académique en rencontrant des étudiants et des professionnels innovants en ingénierie !\n\nC'est le premier événement officiel pour le programme de mentorat de l'ieee uottawa wie (bele). Tout le monde est le bienvenu pour assister à cet événement de réseautage occasionnel (les demandes de mentorat ne sont pas tenues d'y assister).\n\nSi vous êtes intéressé (e) à vous inscrire pour bele mentorat (tous les étudiants bienvenus) :\nhttps://goo.gl/forms/PKNEvICdl9TUwzW92\n\nTu ne sais pas ce que c'est ? Ne craignez rien ! Vous êtes au bon endroit. Bele est un programme de mentorat pour la première année studunts pour s'adapter à la vie à L'Université. Toutes les premières années s'allient avec une année supérieure (idéalement dans la même discipline) donc ils ont quelqu'un pour aider à les guider à travers la folie qui est l'ingénierie de première année.\n\nVenez traîner et jouer à des jeux de société et profiter du chocolat chaud après la folie de la saison à mi-parcours !",
    "url": "https://www.facebook.com/events/711217565918194",
    "image": "../images/big_eng_little_eng_2018_11_07.jpg"
  },
  {
    "id": "2018-11-16-cracking-code-session-2",
    "name": "Cracking the Coding Interview - Session #2",
    "description": "We hope you enjoyed the intro session of Cracking the Coding Interview last week! Join us this friday for session #2, where we will go over some data structures and coding questions that involve them!\n\nIf you haven't already joined the Facebook discussion group for Cracking the Coding Interview, you can find it here: https://www.facebook.com/groups/569650000139322/?ref=br_rs\n\n______________________________\n\nIf your dream company invited you to their offices for a technical interview RIGHT NOW, would you feel well-prepared?\n\nWe invite you to attend \"Cracking the Coding Interview\" — a series of technical interview workshops organized jointly by IEEE uOttawa, CSSA, and SESA, featuring questions from \"Cracking the Coding Interview\" by Gayle McDowell! 💡📖\n\nThe workshops will last 1 hour each, during which experienced mentors will explain and solve certain questions from the book, as well as discuss other interview tips! 📋 The first session will serve as an introduction, and increasingly difficult problems will be discussed in future sessions.\n\nDon't put it off any longer - join us Friday, November 9th at 7PM in CBY B012 for our intro session, and get ready to learn!\n\nSession 1 : Friday, November 9th, 7PM\n\nSession 2: Friday, November 16th, 7PM\n\nSession 3: Friday, November 23rd, 7PM\n\n_______________________________\n\nSi vous étiez invité par votre entreprise de rêve pour assister à une entrevue technique AUJOURD’HUI, vous sentiriez-vous bien préparé ?\n\nNous vous invitons à participer à Cracking the Coding Interview – une série d’ateliers (organisée conjointement par IEEE uOttawa, CSSA, et SESA) abordant tout ce qui concerne les entrevues techniques, avec des questions tirées du livre « Cracking the Coding Interview » par Gayle McDowell ! 💡📖\n\nLes ateliers seront d’une durée d’une heure chaque; pendant ce temps, des mentors expérimentés résoudront et vous expliqueront des questions techniques tirées du livre. Les mentors discuteront également de conseils pour des entrevues ! 📋 La première séance servira d'introduction, et des questions de plus en plus difficiles seront abordées lors des futures séances.\n\nN’attendez pas – rejoignez-nous lors de notre séance d’introduction le vendredi 9 novembre à 19h au local CBY B012, et soyez prêts à apprendre !\n\nPremière séance : le vendredi 9 novembre, 19h\n\nDeuxième séance : le vendredi 16 novembre, 19h\n\nTroisième séance : le vendredi 23 novembre, 19h",
    "url": "https://www.facebook.com/events/351616255602374",
    "image": "../images/cracking_code_session_2_2018_11_16.jpg"
  }
]
