[
  {
    "id": "2018-10-05-office-trivia-night",
    "name": "BEARS.BEETS.the office trivia",
    "description": "Fact. Cafe Nostalgica is the best place you can spend your Monday night. Scranton will be taking over Ottawa so take a break from being The World's Best Boss, your classes at art school, or beet farming to prove you know the most about the Dunder Mifflin family. I can guarantee that you'll leave satisfied and smiling...that's what she said!\n\nGet ready for a night full of trivia from all the seasons and an ample amount of that's what she said jokes (yeah, it might be a good idea to leave your HR friends at home). Reserve your spot by signing up as a team (of 1-4, $20 per team). The top team will get to take home a Dundie (other prizes will also be available)!\n\nThink you've got what it takes to run Dunder Mifflin Scranton? Or will you settle for Assistant to the Regional Manager? Come join us October 5th, 2017 at Cafe Nostalgica to find out!\n\nFor questions or concerns, please email any of the following:\nHeemel Saha - chair@ieeeuottawa.ca\n\n\n*****\n\nCafe Nostalgica est le meilleur endroit où vous pouvez passer votre lundi soir. Ottawa se transformera en Scranton pour une soirée, alors prenez une pause d'être le meilleur patron du monde, des cours à l'école d'art ou de l'élevage de betteraves pour prouver que vous en connaissez le plus à propos de la famille Dunder Mifflin. Je peux vous garantir que vous quitterez satisfait et souriant ... \"that's what she said!\"\n\nPréparez-vous pour une soirée avec des questions venant de toutes les saisons et plusieurs blagues \"that's what she said\" (ça pourrait être une bonne idée de laisser vos amis HR à la maison). Réservez votre place en vous inscrivant en équipe (de 1-4, 20 $ par coéquipier, lien d'inscription d'équipe à venir). La meilleure équipe recevra un Dundee (d'autres prix seront également disponibles)!\n\nPensez-vous avoir ce qu'il faut pour gérez Dunder Mifflin Scranton? Ou bien serrez vous satisfait avec le poste d'assistant du directeur régional? Venez nous rejoindre le 2 octobre 2017 chez Cafe Nostalgica pour en savoir plus!\n\nPour des questions ou des préoccupations, veuillez envoyer un courriel à l'une des adresses suivantes:\nHeemel Saha - chair@ieeeuottawa.ca",
    "url": "https://www.facebook.com/events/1896432193991285",
    "image": "../images/office_trivia_night_2018_10_05.jpg"
  },
  {
    "id": "2018-09-17-engibeering-wings",
    "name": "EngiBEERing: Wing Night Edition",
    "description": "35 CENT WINGS, $3 BURGERS, $2 FRENCH FRIES, $5 POUTINE UNTIL MIDNIGHT!\n\nWhat's better than drinking away all of your back to school sorrows? Nothing. Come get a beer (or 20) with us and have a good time! The best thing about Patty's is that they have a clubbing section upstairs (pub/bar section is on the main floor). Whether you're excited or stressed for school, you deserve a drink to celebrate the start of a new semester. All students regardless of faculty are welcome.\n\nThis is a 19+ event.\n\nPlease direct all questions to Heemel Saha: chair@ieeeuottawa.ca",
    "url": "https://www.facebook.com/events/1185229758324733",
    "image": "../images/engibeering_wings_2018_09_17.jpg"
  },
  {
    "id": "2018-09-24-google-uo",
    "name": "Google at University of Ottawa",
    "description": "Google is coming to the University of Ottawa on September 24 and 25 to host multiple events over the span of the two days! There will be office hours, a resume/interview workshop, and a coding workshop. All of these events are for you to learn more about life at Google and specific job/internship opportunities Google has for students. There will be food and swag while they last! See the poster for more details and be sure to register as some events have limited capacity:\nhttp://bit.ly/2AOIVoD\n\nGoogle sera présent à l'Université d'Ottawa le 24 et 25 septembre pour organiser plusieurs événements intéressants destinés aux étudiants! Au cours de ces deux jours, il y aura un atelier sur les CVs, un atelier de programmation, et des heures de bureau pendant lesquels vous pouvez bavarder avec des employés de Google. Tous ces événements sont organisés pour vous aider à vous renseigner sur les opportunités professionnelles offertes aux étudiant(e)s par Google, ainsi que la culture professionnelle de Google. Il y aura des rafraîchissements et des cadeaux (tant que disponibles)! Pour vous renseigner davantage, veuiller consulter l'affiche ci-jointe. Assurez-vous de vous y inscrire d'avance, car certains événements ont une capacité limitée: http://bit.ly/2AOIVoD",
    "url": "https://www.facebook.com/events/2049645762013536",
    "image": "../images/google_uo_2018_09_24.jpg"
  },
  {
    "id": "2018-10-02-ieee-day",
    "name": "IEEE Day 2018!",
    "description": "FREE PIZZA!*\nDid we get your attention? Great! IEEE Day is fast approaching and we will be commemorating this anniversary of the first time IEEE members gathered to share their technical ideas in 1884 the way they would've wanted, FREE PIZZA!*\n\nCome hang out with us in the IEEE office on Tuesday October 2nd in STE 4026 to learn more about IEEE and the benefits getting a membership can have!\n\n*while quantities last",
    "url": "https://www.facebook.com/events/2368048349877268",
    "image": "../images/ieee_day_2018_10_02.jpg"
  },
  {
    "id": "2018-09-28-agm-continued",
    "name": "IEEE AGM 2018 (continued)",
    "description": "The IEEE uOttawa Student Branch will be continuing our Annual General Meeting to discuss by-elections and constitution changes.\n\nBY-ELECTIONS:\nBy-elections will be taking place during this AGM for the vacant executive positions of the general election for the 2018-2019 term. These positions will include:\n\nVP Communications\n\nThe following executive positions within the IEEE uOttawa Photonics Student Chapter are also vacant, but please note that their eligibility is limited to GRADUATE STUDENTS ONLY, and strong preference is given to candidates with a specialization in Photonics:\n\nChair, Photonics Student Chapter\nVice-Chair, Photonics Student Chapter\n\nIf you are interested in applying for a position on the 2018-2019 Executive Committee, please email chair@ieeeuottawa.ca with your FULL NAME, STUDENT NUMBER, PROGRAM AND YEAR OF STUDY, and state the position you will be running for. The by-elections will be conducted within the AGM by the executive committee.\n\nAs for your application, you along with the other nominees will be allocated 1-2 minutes during the meeting to give a short speech about yourself and what makes you the best candidate for the position. To prepare for this, I would recommend familiarizing yourself with this role's mandate in the IEEE uOttawa Constitution\n(http://www.ieeeuottawa.ca/files/constitution1.pdf). Afterwards, the executives may ask you a few questions regarding the role, and then have an internal vote with the execs. Results will be released during the meeting.\n\n__________________________\n\nLa Branche Étudiante de l'IEEE à uOttawa continuera son Assemblée générale annuelle afin de mener des élections partielles et d'aborder des changements proposées à sa Constitution.\n\nÉLECTIONS PARTIELLES:\nDes élections partielles auront lieu pendant cette réunion afin de remplir des postes exécutifs vides pour l'année scolaire 2018-2019. Les postes vides consistent des suivants:\n\nV.-P. Communications\n\nDe plus, les deux postes de la Branche Étudiante de la Photonique de IEEE uOttawa sont également vides. Cependant, veuillez noter que SEULEMENT LES ÉTUDIANT(E)S DIPLÔMÉ(E)S peuvent postuler pour ces postes, et qu'une forte préférence sera donnée aux étudiant(e)s diplômé(e)s avec une spécialisation en photonique:\n\nPrésident(e), Branche Étudiante de la Photonique\nVice-Président(e), Branche Étudiante de la Photonique\n\nSi vous souhaitez postuler pour un poste sur le comité exécutif 2018-2019, veuillez envoyer un courriel à chair@ieeeuottawa.ca avec votre NOM AU COMPLET, NUMÉRO ÉTUDIANT, PROGRAMME D'ÉTUDES et ANNÉE D'ÉTUDES, et indiquer le rôle pour lequel vous postulez. Les élections partielles seront menés par le comité lors de la réunion.\n\nEn ce qui concerne votre candidature, vous ainsi que les autre candidat(e)s seront allouées 1 à 2 minutes durant la réunion pour faire un bref discours pendant lequel vous pouvez parler de vous-même et pourquoi vois êtes le/la meilleur(e) candidat(e) pour le poste. Pour vous préparer, il est recommandé que vous vous familiarisez avec le mandat du poste en consultant la Constitution de la Branche (http://www.ieeeuottawa.ca/files/constitution1.pdf). Par après, le comité vous demandera quelques questions par rapport au rôle, et mènera un vote interne. Les résultats du vote seront dévoilés pendant la réunion.",
    "url": "https://www.facebook.com/events/325062718266905",
    "image": "../images/agm_continued_2018_09_28.jpg"
  }
]
